Contents of the .debug_info section:

  Compilation Unit @ offset 0:
   Length:        0xc77 (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0
   Pointer Size:  4
 <0><c>: Abbrev Number: 27 (DW_TAG_compile_unit)
    <d>   DW_AT_producer    : (indirect string, offset: 0x3a6a4): GNU C11 12.3.1 20230626 -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <11>   DW_AT_language    : 29	(C11)
    <12>   DW_AT_name        : (indirect string, offset: 0x76280): ../Core/Src/adc.c
    <16>   DW_AT_comp_dir    : (indirect string, offset: 0x2c8d4): /Users/alybadawy/repos/Vexuf-Project/Firmwares/Horus/Debug
    <1a>   DW_AT_ranges      : 0xc
    <1e>   DW_AT_low_pc      : 0
    <22>   DW_AT_stmt_list   : 0
    <26>   DW_AT_macros      : 0
 <1><2a>: Abbrev Number: 13 (DW_TAG_enumeration_type)
    <2b>   DW_AT_encoding    : 5	(signed)
    <2c>   DW_AT_byte_size   : 1
    <2c>   DW_AT_type        : <0x1b7>
    <30>   DW_AT_decl_file   : 2
    <31>   DW_AT_decl_line   : 66
    <32>   DW_AT_decl_column : 1
    <32>   DW_AT_sibling     : <0x1b7>
 <2><36>: Abbrev Number: 9 (DW_TAG_enumerator)
    <37>   DW_AT_name        : (indirect string, offset: 0x8d58a): NonMaskableInt_IRQn
    <3b>   DW_AT_const_value : -14
 <2><3c>: Abbrev Number: 9 (DW_TAG_enumerator)

 <2><180>: Abbrev Number: 1 (DW_TAG_enumerator)
    <181>   DW_AT_name        : (indirect string, offset: 0x5a9a4): OTG_FS_IRQn
    <185>   DW_AT_const_value : 67
 <2><186>: Abbrev Number: 1 (DW_TAG_enumerator)
    <187>   DW_AT_name        : (indirect string, offset: 0x86340): DMA2_Stream5_IRQn
    <18b>   DW_AT_const_value : 68
 <2><18c>: Abbrev Number: 1 (DW_TAG_enumerator)
    <18d>   DW_AT_name        : (indirect string, offset: 0x2dfc2): DMA2_Stream6_IRQn
    <191>   DW_AT_const_value : 69
 <2><192>: Abbrev Number: 1 (DW_TAG_enumerator)
    <193>   DW_AT_name        : (indirect string, offset: 0x77600): DMA2_Stream7_IRQn
    <197>   DW_AT_const_value : 70
 <2><198>: Abbrev Number: 1 (DW_TAG_enumerator)
    <199>   DW_AT_name        : (indirect string, offset: 0x3ebbf): USART6_IRQn
    <19d>   DW_AT_const_value : 71
 <2><19e>: Abbrev Number: 1 (DW_TAG_enumerator)
    <19f>   DW_AT_name        : (indirect string, offset: 0x8deeb): I2C3_EV_IRQn
    <1a3>   DW_AT_const_value : 72
 <2><1a4>: Abbrev Number: 1 (DW_TAG_enumerator)
    <1a5>   DW_AT_name        : (indirect string, offset: 0x1a072): I2C3_ER_IRQn
    <1a9>   DW_AT_const_value : 73
 <2><1aa>: Abbrev Number: 1 (DW_TAG_enumerator)
    <1ab>   DW_AT_name        : (indirect string, offset: 0xbfe1): FPU_IRQn
    <1af>   DW_AT_const_value : 81
 <2><1b0>: Abbrev Number: 1 (DW_TAG_enumerator)
    <1b1>   DW_AT_name        : (indirect string, offset: 0x42de2): SPI4_IRQn
    <1b5>   DW_AT_const_value : 84
 <2><1b6>: Abbrev Number: 0
 <1><1b7>: Abbrev Number: 6 (DW_TAG_base_type)
    <1b8>   DW_AT_byte_size   : 1
    <1b9>   DW_AT_encoding    : 6	(signed char)
    <1ba>   DW_AT_name        : (indirect string, offset: 0x4f5ea): signed char
 <1><1be>: Abbrev Number: 4 (DW_TAG_typedef)
    <1bf>   DW_AT_name        : (indirect string, offset: 0x8b077): IRQn_Type
    <1c3>   DW_AT_decl_file   : 2
    <1c4>   DW_AT_decl_line   : 133
    <1c5>   DW_AT_decl_column : 3
    <1c6>   DW_AT_type        : <0x2a>
 <1><1ca>: Abbrev Number: 6 (DW_TAG_base_type)
    <1cb>   DW_AT_byte_size   : 1
    <1cc>   DW_AT_encoding    : 8	(unsigned char)
    <1cd>   DW_AT_name        : (indirect string, offset: 0x1fd87): unsigned char
 <1><1d1>: Abbrev Number: 6 (DW_TAG_base_type)
    <1d2>   DW_AT_byte_size   : 2
    <1d3>   DW_AT_encoding    : 5	(signed)
    <1d4>   DW_AT_name        : (indirect string, offset: 0x76d1a): short int
 <1><1d8>: Abbrev Number: 4 (DW_TAG_typedef)
    <1d9>   DW_AT_name        : (indirect string, offset: 0x82308): __uint16_t
    <1dd>   DW_AT_decl_file   : 3
    <1de>   DW_AT_decl_line   : 57
    <1df>   DW_AT_decl_column : 25
    <1e0>   DW_AT_type        : <0x1e4>
 <1><1e4>: Abbrev Number: 6 (DW_TAG_base_type)
    <1e5>   DW_AT_byte_size   : 2
    <1e6>   DW_AT_encoding    : 7	(unsigned)
    <1e7>   DW_AT_name        : (indirect string, offset: 0x98670): short unsigned int
 <1><1eb>: Abbrev Number: 6 (DW_TAG_base_type)
    <1ec>   DW_AT_byte_size   : 4
    <1ed>   DW_AT_encoding    : 5	(signed)
    <1ee>   DW_AT_name        : (indirect string, offset: 0xd0e0): long int
 <1><1f2>: Abbrev Number: 4 (DW_TAG_typedef)
    <1f3>   DW_AT_name        : (indirect string, offset: 0x652fb): __uint32_t
    <1f7>   DW_AT_decl_file   : 3
    <1f8>   DW_AT_decl_line   : 79
    <1f9>   DW_AT_decl_column : 25
    <1fa>   DW_AT_type        : <0x1fe>
 <1><1fe>: Abbrev Number: 6 (DW_TAG_base_type)
    <1ff>   DW_AT_byte_size   : 4
    <200>   DW_AT_encoding    : 7	(unsigned)
    <201>   DW_AT_name        : (indirect string, offset: 0x30616): long unsigned int
 <1><205>: Abbrev Number: 6 (DW_TAG_base_type)
    <206>   DW_AT_byte_size   : 8
    <207>   DW_AT_encoding    : 5	(signed)
    <208>   DW_AT_name        : (indirect string, offset: 0x479eb): long long int
 <1><20c>: Abbrev Number: 6 (DW_TAG_base_type)
    <20d>   DW_AT_byte_size   : 8
    <20e>   DW_AT_encoding    : 7	(unsigned)
    <20f>   DW_AT_name        : (indirect string, offset: 0x207ed): long long unsigned int
 <1><213>: Abbrev Number: 28 (DW_TAG_base_type)
    <214>   DW_AT_byte_size   : 4
    <215>   DW_AT_encoding    : 5	(signed)
    <216>   DW_AT_name        : int
 <1><21a>: Abbrev Number: 6 (DW_TAG_base_type)
    <21b>   DW_AT_byte_size   : 4
    <21c>   DW_AT_encoding    : 7	(unsigned)
    <21d>   DW_AT_name        : (indirect string, offset: 0xcaa0): unsigned int
 <1><221>: Abbrev Number: 4 (DW_TAG_typedef)
    <222>   DW_AT_name        : (indirect string, offset: 0x8230a): uint16_t
    <226>   DW_AT_decl_file   : 4
    <227>   DW_AT_decl_line   : 36
    <228>   DW_AT_decl_column : 20
    <229>   DW_AT_type        : <0x1d8>
 <1><22d>: Abbrev Number: 4 (DW_TAG_typedef)
    <22e>   DW_AT_name        : (indirect string, offset: 0x652fd): uint32_t
    <232>   DW_AT_decl_file   : 4
    <233>   DW_AT_decl_line   : 48
    <234>   DW_AT_decl_column : 20
    <235>   DW_AT_type        : <0x1f2>
 <1><239>: Abbrev Number: 17 (DW_TAG_volatile_type)
    <23a>   DW_AT_type        : <0x22d>
 <1><23e>: Abbrev Number: 14 (DW_TAG_array_type)
    <23f>   DW_AT_type        : <0x22d>
    <243>   DW_AT_sibling     : <0x24e>
 <2><247>: Abbrev Number: 15 (DW_TAG_subrange_type)
    <248>   DW_AT_type        : <0x21a>
    <24c>   DW_AT_upper_bound : 0
 <2><24d>: Abbrev Number: 0
 <1><24e>: Abbrev Number: 14 (DW_TAG_array_type)
    <24f>   DW_AT_type        : <0x22d>
    <253>   DW_AT_sibling     : <0x25e>
 <2><257>: Abbrev Number: 15 (DW_TAG_subrange_type)
    <258>   DW_AT_type        : <0x21a>
    <25c>   DW_AT_upper_bound : 1
 <2><25d>: Abbrev Number: 0
 <1><25e>: Abbrev Number: 10 (DW_TAG_structure_type)
    <25f>   DW_AT_byte_size   : 80
    <260>   DW_AT_decl_file   : 2
    <261>   DW_AT_decl_line   : 151
    <262>   DW_AT_decl_column : 9
    <262>   DW_AT_sibling     : <0x369>
 <2><266>: Abbrev Number: 7 (DW_TAG_member)
    <267>   DW_AT_name        : SR
    <26a>   DW_AT_decl_file   : 2
    <26b>   DW_AT_decl_line   : 153
    <26c>   DW_AT_decl_column : 17
    <26d>   DW_AT_type        : <0x239>
    <271>   DW_AT_data_member_location: 0
 <2><272>: Abbrev Number: 7 (DW_TAG_member)
    <273>   DW_AT_name        : CR1
    <277>   DW_AT_decl_file   : 2
    <278>   DW_AT_decl_line   : 154
    <279>   DW_AT_decl_column : 17
    <27a>   DW_AT_type        : <0x239>
    <27e>   DW_AT_data_member_location: 4
 <2><27f>: Abbrev Number: 7 (DW_TAG_member)
    <280>   DW_AT_name        : CR2
    <284>   DW_AT_decl_file   : 2
    <285>   DW_AT_decl_line   : 155
    <286>   DW_AT_decl_column : 17
    <287>   DW_AT_type        : <0x239>
    <28b>   DW_AT_data_member_location: 8
 <2><28c>: Abbrev Number: 2 (DW_TAG_member)
    <28d>   DW_AT_name        : (indirect string, offset: 0x8ef25): SMPR1
    <291>   DW_AT_decl_file   : 2
    <292>   DW_AT_decl_line   : 156
    <293>   DW_AT_decl_column : 17
    <294>   DW_AT_type        : <0x239>
    <298>   DW_AT_data_member_location: 12
 <2><299>: Abbrev Number: 2 (DW_TAG_member)
    <29a>   DW_AT_name        : (indirect string, offset: 0x382cc): SMPR2
    <29e>   DW_AT_decl_file   : 2
    <29f>   DW_AT_decl_line   : 157
    <2a0>   DW_AT_decl_column : 17
    <2a1>   DW_AT_type        : <0x239>
    <2a5>   DW_AT_data_member_location: 16
 <2><2a6>: Abbrev Number: 2 (DW_TAG_member)
    <2a7>   DW_AT_name        : (indirect string, offset: 0x36635): JOFR1
    <2ab>   DW_AT_decl_file   : 2
    <2ac>   DW_AT_decl_line   : 158
    <2ad>   DW_AT_decl_column : 17
    <2ae>   DW_AT_type        : <0x239>
    <2b2>   DW_AT_data_member_location: 20
 <2><2b3>: Abbrev Number: 2 (DW_TAG_member)
    <2b4>   DW_AT_name        : (indirect string, offset: 0x3663b): JOFR2
    <2b8>   DW_AT_decl_file   : 2
    <2b9>   DW_AT_decl_line   : 159
    <2ba>   DW_AT_decl_column : 17
    <2bb>   DW_AT_type        : <0x239>
    <2bf>   DW_AT_data_member_location: 24
 <2><2c0>: Abbrev Number: 2 (DW_TAG_member)
    <2c1>   DW_AT_name        : (indirect string, offset: 0x36641): JOFR3
    <2c5>   DW_AT_decl_file   : 2
    <2c6>   DW_AT_decl_line   : 160
    <2c7>   DW_AT_decl_column : 17
    <2c8>   DW_AT_type        : <0x239>
    <2cc>   DW_AT_data_member_location: 28
 <2><2cd>: Abbrev Number: 2 (DW_TAG_member)
    <2ce>   DW_AT_name        : (indirect string, offset: 0x36647): JOFR4
    <2d2>   DW_AT_decl_file   : 2
    <2d3>   DW_AT_decl_line   : 161
    <2d4>   DW_AT_decl_column : 17
    <2d5>   DW_AT_type        : <0x239>
    <2d9>   DW_AT_data_member_location: 32
 <2><2da>: Abbrev Number: 7 (DW_TAG_member)
    <2db>   DW_AT_name        : HTR
    <2df>   DW_AT_decl_file   : 2
    <2e0>   DW_AT_decl_line   : 162
    <2e1>   DW_AT_decl_column : 17
    <2e2>   DW_AT_type        : <0x239>
    <2e6>   DW_AT_data_member_location: 36
 <2><2e7>: Abbrev Number: 7 (DW_TAG_member)
    <2e8>   DW_AT_name        : LTR
    <2ec>   DW_AT_decl_file   : 2
    <2ed>   DW_AT_decl_line   : 163
    <2ee>   DW_AT_decl_column : 17
    <2ef>   DW_AT_type        : <0x239>
    <2f3>   DW_AT_data_member_location: 40
 <2><2f4>: Abbrev Number: 2 (DW_TAG_member)
    <2f5>   DW_AT_name        : (indirect string, offset: 0xd1b5): SQR1
    <2f9>   DW_AT_decl_file   : 2
    <2fa>   DW_AT_decl_line   : 164
    <2fb>   DW_AT_decl_column : 17
    <2fc>   DW_AT_type        : <0x239>
    <300>   DW_AT_data_member_location: 44
 <2><301>: Abbrev Number: 2 (DW_TAG_member)
    <302>   DW_AT_name        : (indirect string, offset: 0xbd2e): SQR2
    <306>   DW_AT_decl_file   : 2
    <307>   DW_AT_decl_line   : 165
    <308>   DW_AT_decl_column : 17
    <309>   DW_AT_type        : <0x239>
    <30d>   DW_AT_data_member_location: 48
 <2><30e>: Abbrev Number: 2 (DW_TAG_member)
    <30f>   DW_AT_name        : (indirect string, offset: 0xbd33): SQR3
    <313>   DW_AT_decl_file   : 2
    <314>   DW_AT_decl_line   : 166
    <315>   DW_AT_decl_column : 17
    <316>   DW_AT_type        : <0x239>
    <31a>   DW_AT_data_member_location: 52
 <2><31b>: Abbrev Number: 2 (DW_TAG_member)
    <31c>   DW_AT_name        : (indirect string, offset: 0x7a65a): JSQR
    <320>   DW_AT_decl_file   : 2
    <321>   DW_AT_decl_line   : 167
    <322>   DW_AT_decl_column : 17
    <323>   DW_AT_type        : <0x239>
    <327>   DW_AT_data_member_location: 56
 <2><328>: Abbrev Number: 2 (DW_TAG_member)
    <329>   DW_AT_name        : (indirect string, offset: 0x65b9e): JDR1
    <32d>   DW_AT_decl_file   : 2
    <32e>   DW_AT_decl_line   : 168
    <32f>   DW_AT_decl_column : 17
    <330>   DW_AT_type        : <0x239>
    <334>   DW_AT_data_member_location: 60
 <2><335>: Abbrev Number: 2 (DW_TAG_member)
    <336>   DW_AT_name        : (indirect string, offset: 0x65ba3): JDR2
    <33a>   DW_AT_decl_file   : 2
    <33b>   DW_AT_decl_line   : 169
    <33c>   DW_AT_decl_column : 17
    <33d>   DW_AT_type        : <0x239>
    <341>   DW_AT_data_member_location: 64
 <2><342>: Abbrev Number: 2 (DW_TAG_member)
    <343>   DW_AT_name        : (indirect string, offset: 0x65ba8): JDR3
    <347>   DW_AT_decl_file   : 2
    <348>   DW_AT_decl_line   : 170
    <349>   DW_AT_decl_column : 17
    <34a>   DW_AT_type        : <0x239>
    <34e>   DW_AT_data_member_location: 68
 <2><34f>: Abbrev Number: 2 (DW_TAG_member)
    <350>   DW_AT_name        : (indirect string, offset: 0x29a3b): JDR4
    <354>   DW_AT_decl_file   : 2
    <355>   DW_AT_decl_line   : 171
    <356>   DW_AT_decl_column : 17
    <357>   DW_AT_type        : <0x239>
    <35b>   DW_AT_data_member_location: 72
 <2><35c>: Abbrev Number: 7 (DW_TAG_member)
    <35d>   DW_AT_name        : DR
    <360>   DW_AT_decl_file   : 2
    <361>   DW_AT_decl_line   : 172
    <362>   DW_AT_decl_column : 17
    <363>   DW_AT_type        : <0x239>
    <367>   DW_AT_data_member_location: 76
 <2><368>: Abbrev Number: 0
 <1><369>: Abbrev Number: 4 (DW_TAG_typedef)
    <36a>   DW_AT_name        : (indirect string, offset: 0x7a531): ADC_TypeDef
    <36e>   DW_AT_decl_file   : 2
    <36f>   DW_AT_decl_line   : 173
    <370>   DW_AT_decl_column : 3
    <371>   DW_AT_type        : <0x25e>
 <1><375>: Abbrev Number: 10 (DW_TAG_structure_type)
    <376>   DW_AT_byte_size   : 24
    <377>   DW_AT_decl_file   : 2
    <378>   DW_AT_decl_line   : 213
    <379>   DW_AT_decl_column : 9
    <379>   DW_AT_sibling     : <0x3cb>
 <2><37d>: Abbrev Number: 7 (DW_TAG_member)
    <37e>   DW_AT_name        : CR
    <381>   DW_AT_decl_file   : 2
    <382>   DW_AT_decl_line   : 215
    <383>   DW_AT_decl_column : 17
    <384>   DW_AT_type        : <0x239>
    <388>   DW_AT_data_member_location: 0
 <2><389>: Abbrev Number: 2 (DW_TAG_member)
    <38a>   DW_AT_name        : (indirect string, offset: 0x4d800): NDTR
    <38e>   DW_AT_decl_file   : 2
    <38f>   DW_AT_decl_line   : 216
    <390>   DW_AT_decl_column : 17
    <391>   DW_AT_type        : <0x239>
    <395>   DW_AT_data_member_location: 4
 <2><396>: Abbrev Number: 7 (DW_TAG_member)
    <397>   DW_AT_name        : PAR
    <39b>   DW_AT_decl_file   : 2
    <39c>   DW_AT_decl_line   : 217
    <39d>   DW_AT_decl_column : 17
    <39e>   DW_AT_type        : <0x239>
    <3a2>   DW_AT_data_member_location: 8
 <2><3a3>: Abbrev Number: 2 (DW_TAG_member)
    <3a4>   DW_AT_name        : (indirect string, offset: 0x411c9): M0AR
    <3a8>   DW_AT_decl_file   : 2
    <3a9>   DW_AT_decl_line   : 218
    <3aa>   DW_AT_decl_column : 17
    <3ab>   DW_AT_type        : <0x239>
    <3af>   DW_AT_data_member_location: 12
 <2><3b0>: Abbrev Number: 2 (DW_TAG_member)
    <3b1>   DW_AT_name        : (indirect string, offset: 0xeb61): M1AR
    <3b5>   DW_AT_decl_file   : 2
    <3b6>   DW_AT_decl_line   : 219
    <3b7>   DW_AT_decl_column : 17
    <3b8>   DW_AT_type        : <0x239>
    <3bc>   DW_AT_data_member_location: 16
 <2><3bd>: Abbrev Number: 7 (DW_TAG_member)
    <3be>   DW_AT_name        : FCR
    <3c2>   DW_AT_decl_file   : 2
    <3c3>   DW_AT_decl_line   : 220
    <3c4>   DW_AT_decl_column : 17
    <3c5>   DW_AT_type        : <0x239>
    <3c9>   DW_AT_data_member_location: 20
 <2><3ca>: Abbrev Number: 0
 <1><3cb>: Abbrev Number: 4 (DW_TAG_typedef)
    <3cc>   DW_AT_name        : (indirect string, offset: 0x9091e): DMA_Stream_TypeDef
    <3d0>   DW_AT_decl_file   : 2
    <3d1>   DW_AT_decl_line   : 221
    <3d2>   DW_AT_decl_column : 3
    <3d3>   DW_AT_type        : <0x375>
 <1><3d7>: Abbrev Number: 21 (DW_TAG_structure_type)
    <3d8>   DW_AT_byte_size   : 40
    <3d9>   DW_AT_decl_file   : 2
    <3d9>   DW_AT_decl_line   : 264
    <3db>   DW_AT_decl_column : 9
    <3db>   DW_AT_sibling     : <0x44c>
 <2><3df>: Abbrev Number: 3 (DW_TAG_member)
    <3e0>   DW_AT_name        : (indirect string, offset: 0x1383): MODER
    <3e4>   DW_AT_decl_file   : 2
    <3e4>   DW_AT_decl_line   : 266
    <3e6>   DW_AT_decl_column : 17
    <3e6>   DW_AT_type        : <0x239>
    <3ea>   DW_AT_data_member_location: 0
 <2><3eb>: Abbrev Number: 3 (DW_TAG_member)
    <3ec>   DW_AT_name        : (indirect string, offset: 0x7b5d8): OTYPER
    <3f0>   DW_AT_decl_file   : 2
    <3f0>   DW_AT_decl_line   : 267
    <3f2>   DW_AT_decl_column : 17
    <3f2>   DW_AT_type        : <0x239>
    <3f6>   DW_AT_data_member_location: 4
 <2><3f7>: Abbrev Number: 3 (DW_TAG_member)
    <3f8>   DW_AT_name        : (indirect string, offset: 0x8a6b3): OSPEEDR
    <3fc>   DW_AT_decl_file   : 2
    <3fc>   DW_AT_decl_line   : 268
    <3fe>   DW_AT_decl_column : 17
    <3fe>   DW_AT_type        : <0x239>
    <402>   DW_AT_data_member_location: 8
 <2><403>: Abbrev Number: 3 (DW_TAG_member)
    <404>   DW_AT_name        : (indirect string, offset: 0x71bb3): PUPDR
    <408>   DW_AT_decl_file   : 2
    <408>   DW_AT_decl_line   : 269
    <40a>   DW_AT_decl_column : 17
    <40a>   DW_AT_type        : <0x239>
    <40e>   DW_AT_data_member_location: 12
 <2><40f>: Abbrev Number: 11 (DW_TAG_member)
    <410>   DW_AT_name        : IDR
    <414>   DW_AT_decl_file   : 2
    <414>   DW_AT_decl_line   : 270
    <416>   DW_AT_decl_column : 17
    <416>   DW_AT_type        : <0x239>
    <41a>   DW_AT_data_member_location: 16
 <2><41b>: Abbrev Number: 11 (DW_TAG_member)
    <41c>   DW_AT_name        : ODR
    <420>   DW_AT_decl_file   : 2
    <420>   DW_AT_decl_line   : 271
    <422>   DW_AT_decl_column : 17
    <422>   DW_AT_type        : <0x239>
    <426>   DW_AT_data_member_location: 20
 <2><427>: Abbrev Number: 3 (DW_TAG_member)
    <428>   DW_AT_name        : (indirect string, offset: 0x23352): BSRR
    <42c>   DW_AT_decl_file   : 2
    <42c>   DW_AT_decl_line   : 272
    <42e>   DW_AT_decl_column : 17
    <42e>   DW_AT_type        : <0x239>
    <432>   DW_AT_data_member_location: 24
 <2><433>: Abbrev Number: 3 (DW_TAG_member)
    <434>   DW_AT_name        : (indirect string, offset: 0x88821): LCKR
    <438>   DW_AT_decl_file   : 2
    <438>   DW_AT_decl_line   : 273
    <43a>   DW_AT_decl_column : 17
    <43a>   DW_AT_type        : <0x239>
    <43e>   DW_AT_data_member_location: 28
 <2><43f>: Abbrev Number: 11 (DW_TAG_member)
    <440>   DW_AT_name        : AFR
    <444>   DW_AT_decl_file   : 2
    <444>   DW_AT_decl_line   : 274
    <446>   DW_AT_decl_column : 17
    <446>   DW_AT_type        : <0x45c>
    <44a>   DW_AT_data_member_location: 32
 <2><44b>: Abbrev Number: 0
 <1><44c>: Abbrev Number: 14 (DW_TAG_array_type)
    <44d>   DW_AT_type        : <0x239>
    <451>   DW_AT_sibling     : <0x45c>
 <2><455>: Abbrev Number: 15 (DW_TAG_subrange_type)
    <456>   DW_AT_type        : <0x21a>
    <45a>   DW_AT_upper_bound : 1
 <2><45b>: Abbrev Number: 0
 <1><45c>: Abbrev Number: 17 (DW_TAG_volatile_type)
    <45d>   DW_AT_type        : <0x44c>
 <1><461>: Abbrev Number: 22 (DW_TAG_typedef)
    <462>   DW_AT_name        : (indirect string, offset: 0x9a9a2): GPIO_TypeDef
    <466>   DW_AT_decl_file   : 2
    <466>   DW_AT_decl_line   : 275
    <468>   DW_AT_decl_column : 3
    <468>   DW_AT_type        : <0x3d7>
 <1><46c>: Abbrev Number: 21 (DW_TAG_structure_type)
    <46d>   DW_AT_byte_size   : 144
    <46e>   DW_AT_decl_file   : 2
    <46e>   DW_AT_decl_line   : 335
    <470>   DW_AT_decl_column : 9
    <470>   DW_AT_sibling     : <0x5f4>
 <2><474>: Abbrev Number: 11 (DW_TAG_member)
    <475>   DW_AT_name        : CR
    <478>   DW_AT_decl_file   : 2
    <478>   DW_AT_decl_line   : 337
    <47a>   DW_AT_decl_column : 17
    <47a>   DW_AT_type        : <0x239>
    <47e>   DW_AT_data_member_location: 0
 <2><47f>: Abbrev Number: 3 (DW_TAG_member)
    <480>   DW_AT_name        : (indirect string, offset: 0x6f261): PLLCFGR
    <484>   DW_AT_decl_file   : 2
    <484>   DW_AT_decl_line   : 338
    <486>   DW_AT_decl_column : 17
    <486>   DW_AT_type        : <0x239>
    <48a>   DW_AT_data_member_location: 4
 <2><48b>: Abbrev Number: 3 (DW_TAG_member)
    <48c>   DW_AT_name        : (indirect string, offset: 0x44435): CFGR
    <490>   DW_AT_decl_file   : 2
    <490>   DW_AT_decl_line   : 339
    <492>   DW_AT_decl_column : 17
    <492>   DW_AT_type        : <0x239>
    <496>   DW_AT_data_member_location: 8
 <2><497>: Abbrev Number: 11 (DW_TAG_member)
    <498>   DW_AT_name        : CIR
    <49c>   DW_AT_decl_file   : 2
    <49c>   DW_AT_decl_line   : 340
    <49e>   DW_AT_decl_column : 17
    <49e>   DW_AT_type        : <0x239>
    <4a2>   DW_AT_data_member_location: 12
 <2><4a3>: Abbrev Number: 3 (DW_TAG_member)
    <4a4>   DW_AT_name        : (indirect string, offset: 0x7f16b): AHB1RSTR
    <4a8>   DW_AT_decl_file   : 2
    <4a8>   DW_AT_decl_line   : 341
    <4aa>   DW_AT_decl_column : 17
    <4aa>   DW_AT_type        : <0x239>
    <4ae>   DW_AT_data_member_location: 16
 <2><4af>: Abbrev Number: 3 (DW_TAG_member)
    <4b0>   DW_AT_name        : (indirect string, offset: 0x11d91): AHB2RSTR
    <4b4>   DW_AT_decl_file   : 2
    <4b4>   DW_AT_decl_line   : 342
    <4b6>   DW_AT_decl_column : 17
    <4b6>   DW_AT_type        : <0x239>
    <4ba>   DW_AT_data_member_location: 20
 <2><4bb>: Abbrev Number: 3 (DW_TAG_member)
    <4bc>   DW_AT_name        : (indirect string, offset: 0x442b2): AHB3RSTR
    <4c0>   DW_AT_decl_file   : 2
    <4c0>   DW_AT_decl_line   : 343
    <4c2>   DW_AT_decl_column : 17
    <4c2>   DW_AT_type        : <0x239>
    <4c6>   DW_AT_data_member_location: 24
 <2><4c7>: Abbrev Number: 3 (DW_TAG_member)
    <4c8>   DW_AT_name        : (indirect string, offset: 0x9608d): RESERVED0
    <4cc>   DW_AT_decl_file   : 2
    <4cc>   DW_AT_decl_line   : 344
    <4ce>   DW_AT_decl_column : 17
    <4ce>   DW_AT_type        : <0x22d>
    <4d2>   DW_AT_data_member_location: 28
 <2><4d3>: Abbrev Number: 3 (DW_TAG_member)
    <4d4>   DW_AT_name        : (indirect string, offset: 0x1196e): APB1RSTR
    <4d8>   DW_AT_decl_file   : 2
    <4d8>   DW_AT_decl_line   : 345
    <4da>   DW_AT_decl_column : 17
    <4da>   DW_AT_type        : <0x239>
    <4de>   DW_AT_data_member_location: 32
 <2><4df>: Abbrev Number: 3 (DW_TAG_member)
    <4e0>   DW_AT_name        : (indirect string, offset: 0x43dab): APB2RSTR
    <4e4>   DW_AT_decl_file   : 2
    <4e4>   DW_AT_decl_line   : 346
    <4e6>   DW_AT_decl_column : 17
    <4e6>   DW_AT_type        : <0x239>
    <4ea>   DW_AT_data_member_location: 36
 <2><4eb>: Abbrev Number: 3 (DW_TAG_member)
    <4ec>   DW_AT_name        : (indirect string, offset: 0x96097): RESERVED1
    <4f0>   DW_AT_decl_file   : 2
    <4f0>   DW_AT_decl_line   : 347
    <4f2>   DW_AT_decl_column : 17
    <4f2>   DW_AT_type        : <0x24e>
    <4f6>   DW_AT_data_member_location: 40
 <2><4f7>: Abbrev Number: 3 (DW_TAG_member)
    <4f8>   DW_AT_name        : (indirect string, offset: 0xca35): AHB1ENR
    <4fc>   DW_AT_decl_file   : 2
    <4fc>   DW_AT_decl_line   : 348
    <4fe>   DW_AT_decl_column : 17
    <4fe>   DW_AT_type        : <0x239>
    <502>   DW_AT_data_member_location: 48
 <2><503>: Abbrev Number: 3 (DW_TAG_member)
    <504>   DW_AT_name        : (indirect string, offset: 0x29915): AHB2ENR
    <508>   DW_AT_decl_file   : 2
    <508>   DW_AT_decl_line   : 349
    <50a>   DW_AT_decl_column : 17
    <50a>   DW_AT_type        : <0x239>
    <50e>   DW_AT_data_member_location: 52
 <2><50f>: Abbrev Number: 3 (DW_TAG_member)
    <510>   DW_AT_name        : (indirect string, offset: 0x46606): AHB3ENR
    <514>   DW_AT_decl_file   : 2
    <514>   DW_AT_decl_line   : 350
    <516>   DW_AT_decl_column : 17
    <516>   DW_AT_type        : <0x239>
    <51a>   DW_AT_data_member_location: 56
 <2><51b>: Abbrev Number: 3 (DW_TAG_member)
    <51c>   DW_AT_name        : (indirect string, offset: 0x960a1): RESERVED2
    <520>   DW_AT_decl_file   : 2
    <520>   DW_AT_decl_line   : 351
    <522>   DW_AT_decl_column : 17
    <522>   DW_AT_type        : <0x22d>
    <526>   DW_AT_data_member_location: 60
 <2><527>: Abbrev Number: 3 (DW_TAG_member)
    <528>   DW_AT_name        : (indirect string, offset: 0x7804c): APB1ENR
    <52c>   DW_AT_decl_file   : 2
    <52c>   DW_AT_decl_line   : 352
    <52e>   DW_AT_decl_column : 17
    <52e>   DW_AT_type        : <0x239>
    <532>   DW_AT_data_member_location: 64
 <2><533>: Abbrev Number: 3 (DW_TAG_member)
    <534>   DW_AT_name        : (indirect string, offset: 0x125a0): APB2ENR
    <538>   DW_AT_decl_file   : 2
    <538>   DW_AT_decl_line   : 353
    <53a>   DW_AT_decl_column : 17
    <53a>   DW_AT_type        : <0x239>
    <53e>   DW_AT_data_member_location: 68
 <2><53f>: Abbrev Number: 3 (DW_TAG_member)
    <540>   DW_AT_name        : (indirect string, offset: 0x960ab): RESERVED3
    <544>   DW_AT_decl_file   : 2
    <544>   DW_AT_decl_line   : 354
    <546>   DW_AT_decl_column : 17
    <546>   DW_AT_type        : <0x24e>
    <54a>   DW_AT_data_member_location: 72
 <2><54b>: Abbrev Number: 3 (DW_TAG_member)
    <54c>   DW_AT_name        : (indirect string, offset: 0x4e7fa): AHB1LPENR
    <550>   DW_AT_decl_file   : 2
    <550>   DW_AT_decl_line   : 355
    <552>   DW_AT_decl_column : 17
    <552>   DW_AT_type        : <0x239>
    <556>   DW_AT_data_member_location: 80
 <2><557>: Abbrev Number: 3 (DW_TAG_member)
    <558>   DW_AT_name        : (indirect string, offset: 0x22f84): AHB2LPENR
    <55c>   DW_AT_decl_file   : 2
    <55c>   DW_AT_decl_line   : 356
    <55e>   DW_AT_decl_column : 17
    <55e>   DW_AT_type        : <0x239>
    <562>   DW_AT_data_member_location: 84
 <2><563>: Abbrev Number: 3 (DW_TAG_member)
    <564>   DW_AT_name        : (indirect string, offset: 0x6b2f5): AHB3LPENR
    <568>   DW_AT_decl_file   : 2
    <568>   DW_AT_decl_line   : 357
    <56a>   DW_AT_decl_column : 17
    <56a>   DW_AT_type        : <0x239>
    <56e>   DW_AT_data_member_location: 88
 <2><56f>: Abbrev Number: 3 (DW_TAG_member)
    <570>   DW_AT_name        : (indirect string, offset: 0x960b5): RESERVED4
    <574>   DW_AT_decl_file   : 2
    <574>   DW_AT_decl_line   : 358
    <576>   DW_AT_decl_column : 17
    <576>   DW_AT_type        : <0x22d>
    <57a>   DW_AT_data_member_location: 92
 <2><57b>: Abbrev Number: 3 (DW_TAG_member)
    <57c>   DW_AT_name        : (indirect string, offset: 0x6996a): APB1LPENR
    <580>   DW_AT_decl_file   : 2
    <580>   DW_AT_decl_line   : 359
    <582>   DW_AT_decl_column : 17
    <582>   DW_AT_type        : <0x239>
    <586>   DW_AT_data_member_location: 96
 <2><587>: Abbrev Number: 3 (DW_TAG_member)
    <588>   DW_AT_name        : (indirect string, offset: 0xbc3c): APB2LPENR
    <58c>   DW_AT_decl_file   : 2
    <58c>   DW_AT_decl_line   : 360
    <58e>   DW_AT_decl_column : 17
    <58e>   DW_AT_type        : <0x239>
    <592>   DW_AT_data_member_location: 100
 <2><593>: Abbrev Number: 3 (DW_TAG_member)
    <594>   DW_AT_name        : (indirect string, offset: 0x960bf): RESERVED5
    <598>   DW_AT_decl_file   : 2
    <598>   DW_AT_decl_line   : 361
    <59a>   DW_AT_decl_column : 17
    <59a>   DW_AT_type        : <0x24e>
    <59e>   DW_AT_data_member_location: 104
 <2><59f>: Abbrev Number: 3 (DW_TAG_member)
    <5a0>   DW_AT_name        : (indirect string, offset: 0x15d36): BDCR
    <5a4>   DW_AT_decl_file   : 2
    <5a4>   DW_AT_decl_line   : 362
    <5a6>   DW_AT_decl_column : 17
    <5a6>   DW_AT_type        : <0x239>
    <5aa>   DW_AT_data_member_location: 112
 <2><5ab>: Abbrev Number: 11 (DW_TAG_member)
    <5ac>   DW_AT_name        : CSR
    <5b0>   DW_AT_decl_file   : 2
    <5b0>   DW_AT_decl_line   : 363
    <5b2>   DW_AT_decl_column : 17
    <5b2>   DW_AT_type        : <0x239>
    <5b6>   DW_AT_data_member_location: 116
 <2><5b7>: Abbrev Number: 3 (DW_TAG_member)
    <5b8>   DW_AT_name        : (indirect string, offset: 0x960c9): RESERVED6
    <5bc>   DW_AT_decl_file   : 2
    <5bc>   DW_AT_decl_line   : 364
    <5be>   DW_AT_decl_column : 17
    <5be>   DW_AT_type        : <0x24e>
    <5c2>   DW_AT_data_member_location: 120
 <2><5c3>: Abbrev Number: 3 (DW_TAG_member)
    <5c4>   DW_AT_name        : (indirect string, offset: 0x53cec): SSCGR
    <5c8>   DW_AT_decl_file   : 2
    <5c8>   DW_AT_decl_line   : 365
    <5ca>   DW_AT_decl_column : 17
    <5ca>   DW_AT_type        : <0x239>
    <5ce>   DW_AT_data_member_location: 128
 <2><5cf>: Abbrev Number: 3 (DW_TAG_member)
    <5d0>   DW_AT_name        : (indirect string, offset: 0x33fb7): PLLI2SCFGR
    <5d4>   DW_AT_decl_file   : 2
    <5d4>   DW_AT_decl_line   : 366
    <5d6>   DW_AT_decl_column : 17
    <5d6>   DW_AT_type        : <0x239>
    <5da>   DW_AT_data_member_location: 132
 <2><5db>: Abbrev Number: 3 (DW_TAG_member)
    <5dc>   DW_AT_name        : (indirect string, offset: 0x960d3): RESERVED7
    <5e0>   DW_AT_decl_file   : 2
    <5e0>   DW_AT_decl_line   : 367
    <5e2>   DW_AT_decl_column : 17
    <5e2>   DW_AT_type        : <0x23e>
    <5e6>   DW_AT_data_member_location: 136
 <2><5e7>: Abbrev Number: 3 (DW_TAG_member)
    <5e8>   DW_AT_name        : (indirect string, offset: 0x44432): DCKCFGR
    <5ec>   DW_AT_decl_file   : 2
    <5ec>   DW_AT_decl_line   : 368
    <5ee>   DW_AT_decl_column : 17
    <5ee>   DW_AT_type        : <0x239>
    <5f2>   DW_AT_data_member_location: 140
 <2><5f3>: Abbrev Number: 0
 <1><5f4>: Abbrev Number: 22 (DW_TAG_typedef)
    <5f5>   DW_AT_name        : (indirect string, offset: 0x49034): RCC_TypeDef
    <5f9>   DW_AT_decl_file   : 2
    <5f9>   DW_AT_decl_line   : 369
    <5fb>   DW_AT_decl_column : 3
    <5fb>   DW_AT_type        : <0x46c>
 <1><5ff>: Abbrev Number: 13 (DW_TAG_enumeration_type)
    <600>   DW_AT_encoding    : 7	(unsigned)
    <601>   DW_AT_byte_size   : 1
    <601>   DW_AT_type        : <0x1ca>
    <605>   DW_AT_decl_file   : 5
    <606>   DW_AT_decl_line   : 191
    <607>   DW_AT_decl_column : 1
    <607>   DW_AT_sibling     : <0x618>
 <2><60b>: Abbrev Number: 1 (DW_TAG_enumerator)
    <60c>   DW_AT_name        : (indirect string, offset: 0x4afb7): DISABLE
    <610>   DW_AT_const_value : 0
 <2><611>: Abbrev Number: 1 (DW_TAG_enumerator)
    <612>   DW_AT_name        : (indirect string, offset: 0x90e5c): ENABLE
    <616>   DW_AT_const_value : 1
 <2><617>: Abbrev Number: 0
 <1><618>: Abbrev Number: 4 (DW_TAG_typedef)
    <619>   DW_AT_name        : (indirect string, offset: 0x9e285): FunctionalState
    <61d>   DW_AT_decl_file   : 5
    <61e>   DW_AT_decl_line   : 194
    <61f>   DW_AT_decl_column : 3
    <620>   DW_AT_type        : <0x5ff>
 <1><624>: Abbrev Number: 6 (DW_TAG_base_type)
    <625>   DW_AT_byte_size   : 8
    <626>   DW_AT_encoding    : 4	(float)
    <627>   DW_AT_name        : (indirect string, offset: 0xa336e): long double
 <1><62b>: Abbrev Number: 13 (DW_TAG_enumeration_type)
    <62c>   DW_AT_encoding    : 7	(unsigned)
    <62d>   DW_AT_byte_size   : 1
    <62d>   DW_AT_type        : <0x1ca>
    <631>   DW_AT_decl_file   : 6
    <632>   DW_AT_decl_line   : 39
    <633>   DW_AT_decl_column : 1
    <633>   DW_AT_sibling     : <0x650>
 <2><637>: Abbrev Number: 1 (DW_TAG_enumerator)
    <638>   DW_AT_name        : (indirect string, offset: 0x35162): HAL_OK
    <63c>   DW_AT_const_value : 0
 <2><63d>: Abbrev Number: 1 (DW_TAG_enumerator)
    <63e>   DW_AT_name        : (indirect string, offset: 0x634b4): HAL_ERROR
    <642>   DW_AT_const_value : 1
 <2><643>: Abbrev Number: 1 (DW_TAG_enumerator)
    <644>   DW_AT_name        : (indirect string, offset: 0x852f1): HAL_BUSY
    <648>   DW_AT_const_value : 2
 <2><649>: Abbrev Number: 1 (DW_TAG_enumerator)
    <64a>   DW_AT_name        : (indirect string, offset: 0x2ddba): HAL_TIMEOUT
    <64e>   DW_AT_const_value : 3
 <2><64f>: Abbrev Number: 0
 <1><650>: Abbrev Number: 4 (DW_TAG_typedef)
    <651>   DW_AT_name        : (indirect string, offset: 0x8eded): HAL_StatusTypeDef
    <655>   DW_AT_decl_file   : 6
    <656>   DW_AT_decl_line   : 44
    <657>   DW_AT_decl_column : 3
    <658>   DW_AT_type        : <0x62b>
 <1><65c>: Abbrev Number: 13 (DW_TAG_enumeration_type)
    <65d>   DW_AT_encoding    : 7	(unsigned)
    <65e>   DW_AT_byte_size   : 1
    <65e>   DW_AT_type        : <0x1ca>
    <662>   DW_AT_decl_file   : 6
    <663>   DW_AT_decl_line   : 50
    <664>   DW_AT_decl_column : 1
    <664>   DW_AT_sibling     : <0x675>
 <2><668>: Abbrev Number: 1 (DW_TAG_enumerator)
    <669>   DW_AT_name        : (indirect string, offset: 0x76006): HAL_UNLOCKED
    <66d>   DW_AT_const_value : 0
 <2><66e>: Abbrev Number: 1 (DW_TAG_enumerator)
    <66f>   DW_AT_name        : (indirect string, offset: 0x9ec6b): HAL_LOCKED
    <673>   DW_AT_const_value : 1
 <2><674>: Abbrev Number: 0
 <1><675>: Abbrev Number: 4 (DW_TAG_typedef)
    <676>   DW_AT_name        : (indirect string, offset: 0x60c08): HAL_LockTypeDef
    <67a>   DW_AT_decl_file   : 6
    <67b>   DW_AT_decl_line   : 53
    <67c>   DW_AT_decl_column : 3
    <67d>   DW_AT_type        : <0x65c>
 <1><681>: Abbrev Number: 10 (DW_TAG_structure_type)
    <682>   DW_AT_byte_size   : 20
    <683>   DW_AT_decl_file   : 7
    <684>   DW_AT_decl_line   : 46
    <685>   DW_AT_decl_column : 9
    <685>   DW_AT_sibling     : <0x6cb>
 <2><689>: Abbrev Number: 7 (DW_TAG_member)
    <68a>   DW_AT_name        : Pin
    <68e>   DW_AT_decl_file   : 7
    <68f>   DW_AT_decl_line   : 48
    <690>   DW_AT_decl_column : 12
    <691>   DW_AT_type        : <0x22d>
    <695>   DW_AT_data_member_location: 0
 <2><696>: Abbrev Number: 2 (DW_TAG_member)
    <697>   DW_AT_name        : (indirect string, offset: 0xa7017): Mode
    <69b>   DW_AT_decl_file   : 7
    <69c>   DW_AT_decl_line   : 51
    <69d>   DW_AT_decl_column : 12
    <69e>   DW_AT_type        : <0x22d>
    <6a2>   DW_AT_data_member_location: 4
 <2><6a3>: Abbrev Number: 2 (DW_TAG_member)
    <6a4>   DW_AT_name        : (indirect string, offset: 0x5181e): Pull
    <6a8>   DW_AT_decl_file   : 7
    <6a9>   DW_AT_decl_line   : 54
    <6aa>   DW_AT_decl_column : 12
    <6ab>   DW_AT_type        : <0x22d>
    <6af>   DW_AT_data_member_location: 8
 <2><6b0>: Abbrev Number: 2 (DW_TAG_member)
    <6b1>   DW_AT_name        : (indirect string, offset: 0x9fdd0): Speed
    <6b5>   DW_AT_decl_file   : 7
    <6b6>   DW_AT_decl_line   : 57
    <6b7>   DW_AT_decl_column : 12
    <6b8>   DW_AT_type        : <0x22d>
    <6bc>   DW_AT_data_member_location: 12
 <2><6bd>: Abbrev Number: 2 (DW_TAG_member)
    <6be>   DW_AT_name        : (indirect string, offset: 0x48006): Alternate
    <6c2>   DW_AT_decl_file   : 7
    <6c3>   DW_AT_decl_line   : 60
    <6c4>   DW_AT_decl_column : 12
    <6c5>   DW_AT_type        : <0x22d>
    <6c9>   DW_AT_data_member_location: 16
 <2><6ca>: Abbrev Number: 0
 <1><6cb>: Abbrev Number: 4 (DW_TAG_typedef)
    <6cc>   DW_AT_name        : (indirect string, offset: 0x7ca7a): GPIO_InitTypeDef
    <6d0>   DW_AT_decl_file   : 7
    <6d1>   DW_AT_decl_line   : 62
    <6d2>   DW_AT_decl_column : 2
    <6d3>   DW_AT_type        : <0x681>
 <1><6d7>: Abbrev Number: 10 (DW_TAG_structure_type)
    <6d8>   DW_AT_byte_size   : 48
    <6d9>   DW_AT_decl_file   : 8
    <6da>   DW_AT_decl_line   : 48
    <6db>   DW_AT_decl_column : 9
    <6db>   DW_AT_sibling     : <0x77c>
 <2><6df>: Abbrev Number: 2 (DW_TAG_member)
    <6e0>   DW_AT_name        : (indirect string, offset: 0xa7a9f): Channel
    <6e4>   DW_AT_decl_file   : 8
    <6e5>   DW_AT_decl_line   : 50
    <6e6>   DW_AT_decl_column : 12
    <6e7>   DW_AT_type        : <0x22d>
    <6eb>   DW_AT_data_member_location: 0
 <2><6ec>: Abbrev Number: 2 (DW_TAG_member)
    <6ed>   DW_AT_name        : (indirect string, offset: 0xa8b92): Direction
    <6f1>   DW_AT_decl_file   : 8
    <6f2>   DW_AT_decl_line   : 53
    <6f3>   DW_AT_decl_column : 12
    <6f4>   DW_AT_type        : <0x22d>
    <6f8>   DW_AT_data_member_location: 4
 <2><6f9>: Abbrev Number: 2 (DW_TAG_member)
    <6fa>   DW_AT_name        : (indirect string, offset: 0xa4a5): PeriphInc
    <6fe>   DW_AT_decl_file   : 8
    <6ff>   DW_AT_decl_line   : 57
    <700>   DW_AT_decl_column : 12
    <701>   DW_AT_type        : <0x22d>
    <705>   DW_AT_data_member_location: 8
 <2><706>: Abbrev Number: 2 (DW_TAG_member)
    <707>   DW_AT_name        : (indirect string, offset: 0x18997): MemInc
    <70b>   DW_AT_decl_file   : 8
    <70c>   DW_AT_decl_line   : 60
    <70d>   DW_AT_decl_column : 12
    <70e>   DW_AT_type        : <0x22d>
    <712>   DW_AT_data_member_location: 12
 <2><713>: Abbrev Number: 2 (DW_TAG_member)
    <714>   DW_AT_name        : (indirect string, offset: 0x4ec72): PeriphDataAlignment
    <718>   DW_AT_decl_file   : 8
    <719>   DW_AT_decl_line   : 63
    <71a>   DW_AT_decl_column : 12
    <71b>   DW_AT_type        : <0x22d>
    <71f>   DW_AT_data_member_location: 16
 <2><720>: Abbrev Number: 2 (DW_TAG_member)
    <721>   DW_AT_name        : (indirect string, offset: 0x8fef3): MemDataAlignment
    <725>   DW_AT_decl_file   : 8
    <726>   DW_AT_decl_line   : 66
    <727>   DW_AT_decl_column : 12
    <728>   DW_AT_type        : <0x22d>
    <72c>   DW_AT_data_member_location: 20
 <2><72d>: Abbrev Number: 2 (DW_TAG_member)
    <72e>   DW_AT_name        : (indirect string, offset: 0xa7017): Mode
    <732>   DW_AT_decl_file   : 8
    <733>   DW_AT_decl_line   : 69
    <734>   DW_AT_decl_column : 12
    <735>   DW_AT_type        : <0x22d>
    <739>   DW_AT_data_member_location: 24
 <2><73a>: Abbrev Number: 2 (DW_TAG_member)
    <73b>   DW_AT_name        : (indirect string, offset: 0xa7e98): Priority
    <73f>   DW_AT_decl_file   : 8
    <740>   DW_AT_decl_line   : 74
    <741>   DW_AT_decl_column : 12
    <742>   DW_AT_type        : <0x22d>
    <746>   DW_AT_data_member_location: 28
 <2><747>: Abbrev Number: 2 (DW_TAG_member)
    <748>   DW_AT_name        : (indirect string, offset: 0x43844): FIFOMode
    <74c>   DW_AT_decl_file   : 8
    <74d>   DW_AT_decl_line   : 77
    <74e>   DW_AT_decl_column : 12
    <74f>   DW_AT_type        : <0x22d>
    <753>   DW_AT_data_member_location: 32
 <2><754>: Abbrev Number: 2 (DW_TAG_member)
    <755>   DW_AT_name        : (indirect string, offset: 0x79372): FIFOThreshold
    <759>   DW_AT_decl_file   : 8
    <75a>   DW_AT_decl_line   : 82
    <75b>   DW_AT_decl_column : 12
    <75c>   DW_AT_type        : <0x22d>
    <760>   DW_AT_data_member_location: 36
 <2><761>: Abbrev Number: 2 (DW_TAG_member)
    <762>   DW_AT_name        : (indirect string, offset: 0x3e3ba): MemBurst
    <766>   DW_AT_decl_file   : 8
    <767>   DW_AT_decl_line   : 85
    <768>   DW_AT_decl_column : 12
    <769>   DW_AT_type        : <0x22d>
    <76d>   DW_AT_data_member_location: 40
 <2><76e>: Abbrev Number: 2 (DW_TAG_member)
    <76f>   DW_AT_name        : (indirect string, offset: 0x35e6e): PeriphBurst
    <773>   DW_AT_decl_file   : 8
    <774>   DW_AT_decl_line   : 91
    <775>   DW_AT_decl_column : 12
    <776>   DW_AT_type        : <0x22d>
    <77a>   DW_AT_data_member_location: 44
 <2><77b>: Abbrev Number: 0
 <1><77c>: Abbrev Number: 4 (DW_TAG_typedef)
    <77d>   DW_AT_name        : (indirect string, offset: 0x2a12a): DMA_InitTypeDef
    <781>   DW_AT_decl_file   : 8
    <782>   DW_AT_decl_line   : 96
    <783>   DW_AT_decl_column : 2
    <784>   DW_AT_type        : <0x6d7>
 <1><788>: Abbrev Number: 13 (DW_TAG_enumeration_type)
    <789>   DW_AT_encoding    : 7	(unsigned)
    <78a>   DW_AT_byte_size   : 1
    <78a>   DW_AT_type        : <0x1ca>
    <78e>   DW_AT_decl_file   : 8
    <78f>   DW_AT_decl_line   : 103
    <790>   DW_AT_decl_column : 1
    <790>   DW_AT_sibling     : <0x7b9>
 <2><794>: Abbrev Number: 1 (DW_TAG_enumerator)
    <795>   DW_AT_name        : (indirect string, offset: 0x76fa2): HAL_DMA_STATE_RESET
    <799>   DW_AT_const_value : 0
 <2><79a>: Abbrev Number: 1 (DW_TAG_enumerator)
    <79b>   DW_AT_name        : (indirect string, offset: 0x2b0c8): HAL_DMA_STATE_READY
    <79f>   DW_AT_const_value : 1
 <2><7a0>: Abbrev Number: 1 (DW_TAG_enumerator)
    <7a1>   DW_AT_name        : (indirect string, offset: 0x6df01): HAL_DMA_STATE_BUSY
    <7a5>   DW_AT_const_value : 2
 <2><7a6>: Abbrev Number: 1 (DW_TAG_enumerator)
    <7a7>   DW_AT_name        : (indirect string, offset: 0x9c863): HAL_DMA_STATE_TIMEOUT
    <7ab>   DW_AT_const_value : 3
 <2><7ac>: Abbrev Number: 1 (DW_TAG_enumerator)
    <7ad>   DW_AT_name        : (indirect string, offset: 0x88538): HAL_DMA_STATE_ERROR
    <7b1>   DW_AT_const_value : 4
 <2><7b2>: Abbrev Number: 1 (DW_TAG_enumerator)
    <7b3>   DW_AT_name        : (indirect string, offset: 0x23a13): HAL_DMA_STATE_ABORT
    <7b7>   DW_AT_const_value : 5
 <2><7b8>: Abbrev Number: 0
 <1><7b9>: Abbrev Number: 4 (DW_TAG_typedef)
    <7ba>   DW_AT_name        : (indirect string, offset: 0x579ef): HAL_DMA_StateTypeDef
    <7be>   DW_AT_decl_file   : 8
    <7bf>   DW_AT_decl_line   : 110
    <7c0>   DW_AT_decl_column : 2
    <7c1>   DW_AT_type        : <0x788>
 <1><7c5>: Abbrev Number: 17 (DW_TAG_volatile_type)
    <7c6>   DW_AT_type        : <0x7b9>
 <1><7ca>: Abbrev Number: 29 (DW_TAG_structure_type)
    <7cb>   DW_AT_name        : (indirect string, offset: 0x87882): __DMA_HandleTypeDef
    <7cf>   DW_AT_byte_size   : 96
    <7d0>   DW_AT_decl_file   : 8
    <7d1>   DW_AT_decl_line   : 138
    <7d2>   DW_AT_decl_column : 16
    <7d3>   DW_AT_sibling     : <0x88e>
 <2><7d7>: Abbrev Number: 2 (DW_TAG_member)
    <7d8>   DW_AT_name        : (indirect string, offset: 0x3d10f): Instance
    <7dc>   DW_AT_decl_file   : 8
    <7dd>   DW_AT_decl_line   : 140
    <7de>   DW_AT_decl_column : 31
    <7df>   DW_AT_type        : <0x88e>
    <7e3>   DW_AT_data_member_location: 0
 <2><7e4>: Abbrev Number: 2 (DW_TAG_member)
    <7e5>   DW_AT_name        : (indirect string, offset: 0xa9210): Init
    <7e9>   DW_AT_decl_file   : 8
    <7ea>   DW_AT_decl_line   : 142
    <7eb>   DW_AT_decl_column : 30
    <7ec>   DW_AT_type        : <0x77c>
    <7f0>   DW_AT_data_member_location: 4
 <2><7f1>: Abbrev Number: 2 (DW_TAG_member)
    <7f2>   DW_AT_name        : (indirect string, offset: 0x716d1): Lock
    <7f6>   DW_AT_decl_file   : 8
    <7f7>   DW_AT_decl_line   : 144
    <7f8>   DW_AT_decl_column : 30
    <7f9>   DW_AT_type        : <0x675>
    <7fd>   DW_AT_data_member_location: 52
 <2><7fe>: Abbrev Number: 2 (DW_TAG_member)
    <7ff>   DW_AT_name        : (indirect string, offset: 0xa29ad): State
    <803>   DW_AT_decl_file   : 8
    <804>   DW_AT_decl_line   : 146
    <805>   DW_AT_decl_column : 30
    <806>   DW_AT_type        : <0x7c5>
    <80a>   DW_AT_data_member_location: 53
 <2><80b>: Abbrev Number: 2 (DW_TAG_member)
    <80c>   DW_AT_name        : (indirect string, offset: 0x9756f): Parent
    <810>   DW_AT_decl_file   : 8
    <811>   DW_AT_decl_line   : 148
    <812>   DW_AT_decl_column : 31
    <813>   DW_AT_type        : <0x893>
    <817>   DW_AT_data_member_location: 56
 <2><818>: Abbrev Number: 2 (DW_TAG_member)
    <819>   DW_AT_name        : (indirect string, offset: 0x9e47a): XferCpltCallback
    <81d>   DW_AT_decl_file   : 8
    <81e>   DW_AT_decl_line   : 150
    <81f>   DW_AT_decl_column : 33
    <820>   DW_AT_type        : <0x8a5>
    <824>   DW_AT_data_member_location: 60
 <2><825>: Abbrev Number: 2 (DW_TAG_member)
    <826>   DW_AT_name        : (indirect string, offset: 0x7bd62): XferHalfCpltCallback
    <82a>   DW_AT_decl_file   : 8
    <82b>   DW_AT_decl_line   : 152
    <82c>   DW_AT_decl_column : 33
    <82d>   DW_AT_type        : <0x8a5>
    <831>   DW_AT_data_member_location: 64
 <2><832>: Abbrev Number: 2 (DW_TAG_member)
    <833>   DW_AT_name        : (indirect string, offset: 0x25597): XferM1CpltCallback
    <837>   DW_AT_decl_file   : 8
    <838>   DW_AT_decl_line   : 154
    <839>   DW_AT_decl_column : 33
    <83a>   DW_AT_type        : <0x8a5>
    <83e>   DW_AT_data_member_location: 68
 <2><83f>: Abbrev Number: 2 (DW_TAG_member)
    <840>   DW_AT_name        : (indirect string, offset: 0x57c58): XferM1HalfCpltCallback
    <844>   DW_AT_decl_file   : 8
    <845>   DW_AT_decl_line   : 156
    <846>   DW_AT_decl_column : 33
    <847>   DW_AT_type        : <0x8a5>
    <84b>   DW_AT_data_member_location: 72
 <2><84c>: Abbrev Number: 2 (DW_TAG_member)
    <84d>   DW_AT_name        : (indirect string, offset: 0x16b0b): XferErrorCallback
    <851>   DW_AT_decl_file   : 8
    <852>   DW_AT_decl_line   : 158
    <853>   DW_AT_decl_column : 33
    <854>   DW_AT_type        : <0x8a5>
    <858>   DW_AT_data_member_location: 76
 <2><859>: Abbrev Number: 2 (DW_TAG_member)
    <85a>   DW_AT_name        : (indirect string, offset: 0x949e3): XferAbortCallback
    <85e>   DW_AT_decl_file   : 8
    <85f>   DW_AT_decl_line   : 160
    <860>   DW_AT_decl_column : 33
    <861>   DW_AT_type        : <0x8a5>
    <865>   DW_AT_data_member_location: 80
 <2><866>: Abbrev Number: 2 (DW_TAG_member)
    <867>   DW_AT_name        : (indirect string, offset: 0xaa0ab): ErrorCode
    <86b>   DW_AT_decl_file   : 8
    <86c>   DW_AT_decl_line   : 162
    <86d>   DW_AT_decl_column : 30
    <86e>   DW_AT_type        : <0x239>
    <872>   DW_AT_data_member_location: 84
 <2><873>: Abbrev Number: 2 (DW_TAG_member)
    <874>   DW_AT_name        : (indirect string, offset: 0x7866f): StreamBaseAddress
    <878>   DW_AT_decl_file   : 8
    <879>   DW_AT_decl_line   : 164
    <87a>   DW_AT_decl_column : 30
    <87b>   DW_AT_type        : <0x22d>
    <87f>   DW_AT_data_member_location: 88
 <2><880>: Abbrev Number: 2 (DW_TAG_member)
    <881>   DW_AT_name        : (indirect string, offset: 0x86058): StreamIndex
    <885>   DW_AT_decl_file   : 8
    <886>   DW_AT_decl_line   : 166
    <887>   DW_AT_decl_column : 30
    <888>   DW_AT_type        : <0x22d>
    <88c>   DW_AT_data_member_location: 92
 <2><88d>: Abbrev Number: 0
 <1><88e>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <88f>   DW_AT_byte_size   : 4
    <88f>   DW_AT_type        : <0x3cb>
 <1><893>: Abbrev Number: 30 (DW_TAG_pointer_type)
    <894>   DW_AT_byte_size   : 4
 <1><895>: Abbrev Number: 31 (DW_TAG_subroutine_type)
    <896>   DW_AT_prototyped  : 1
    <896>   DW_AT_sibling     : <0x8a0>
 <2><89a>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <89b>   DW_AT_type        : <0x8a0>
 <2><89f>: Abbrev Number: 0
 <1><8a0>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <8a1>   DW_AT_byte_size   : 4
    <8a1>   DW_AT_type        : <0x7ca>
 <1><8a5>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <8a6>   DW_AT_byte_size   : 4
    <8a6>   DW_AT_type        : <0x895>
 <1><8aa>: Abbrev Number: 4 (DW_TAG_typedef)
    <8ab>   DW_AT_name        : (indirect string, offset: 0x87884): DMA_HandleTypeDef
    <8af>   DW_AT_decl_file   : 8
    <8b0>   DW_AT_decl_line   : 168
    <8b1>   DW_AT_decl_column : 2
    <8b2>   DW_AT_type        : <0x7ca>
 <1><8b6>: Abbrev Number: 10 (DW_TAG_structure_type)
    <8b7>   DW_AT_byte_size   : 48
    <8b8>   DW_AT_decl_file   : 9
    <8b9>   DW_AT_decl_line   : 59
    <8ba>   DW_AT_decl_column : 9
    <8ba>   DW_AT_sibling     : <0x95b>
 <2><8be>: Abbrev Number: 2 (DW_TAG_member)
    <8bf>   DW_AT_name        : (indirect string, offset: 0x8c7a4): ClockPrescaler
    <8c3>   DW_AT_decl_file   : 9
    <8c4>   DW_AT_decl_line   : 61
    <8c5>   DW_AT_decl_column : 12
    <8c6>   DW_AT_type        : <0x22d>
    <8ca>   DW_AT_data_member_location: 0
 <2><8cb>: Abbrev Number: 2 (DW_TAG_member)
    <8cc>   DW_AT_name        : (indirect string, offset: 0xc81a): Resolution
    <8d0>   DW_AT_decl_file   : 9
    <8d1>   DW_AT_decl_line   : 64
    <8d2>   DW_AT_decl_column : 12
    <8d3>   DW_AT_type        : <0x22d>
    <8d7>   DW_AT_data_member_location: 4
 <2><8d8>: Abbrev Number: 2 (DW_TAG_member)
    <8d9>   DW_AT_name        : (indirect string, offset: 0x21fe6): DataAlign
    <8dd>   DW_AT_decl_file   : 9
    <8de>   DW_AT_decl_line   : 66
    <8df>   DW_AT_decl_column : 12
    <8e0>   DW_AT_type        : <0x22d>
    <8e4>   DW_AT_data_member_location: 8
 <2><8e5>: Abbrev Number: 2 (DW_TAG_member)
    <8e6>   DW_AT_name        : (indirect string, offset: 0x5fade): ScanConvMode
    <8ea>   DW_AT_decl_file   : 9
    <8eb>   DW_AT_decl_line   : 69
    <8ec>   DW_AT_decl_column : 12
    <8ed>   DW_AT_type        : <0x22d>
    <8f1>   DW_AT_data_member_location: 12
 <2><8f2>: Abbrev Number: 2 (DW_TAG_member)
    <8f3>   DW_AT_name        : (indirect string, offset: 0x69c75): EOCSelection
    <8f7>   DW_AT_decl_file   : 9
    <8f8>   DW_AT_decl_line   : 76
    <8f9>   DW_AT_decl_column : 12
    <8fa>   DW_AT_type        : <0x22d>
    <8fe>   DW_AT_data_member_location: 16
 <2><8ff>: Abbrev Number: 2 (DW_TAG_member)
    <900>   DW_AT_name        : (indirect string, offset: 0x419f0): ContinuousConvMode
    <904>   DW_AT_decl_file   : 9
    <905>   DW_AT_decl_line   : 83
    <906>   DW_AT_decl_column : 19
    <907>   DW_AT_type        : <0x618>
    <90b>   DW_AT_data_member_location: 20
 <2><90c>: Abbrev Number: 2 (DW_TAG_member)
    <90d>   DW_AT_name        : (indirect string, offset: 0xa7ae8): NbrOfConversion
    <911>   DW_AT_decl_file   : 9
    <912>   DW_AT_decl_line   : 86
    <913>   DW_AT_decl_column : 12
    <914>   DW_AT_type        : <0x22d>
    <918>   DW_AT_data_member_location: 24
 <2><919>: Abbrev Number: 2 (DW_TAG_member)
    <91a>   DW_AT_name        : (indirect string, offset: 0xa7c0f): DiscontinuousConvMode
    <91e>   DW_AT_decl_file   : 9
    <91f>   DW_AT_decl_line   : 89
    <920>   DW_AT_decl_column : 19
    <921>   DW_AT_type        : <0x618>
    <925>   DW_AT_data_member_location: 28
 <2><926>: Abbrev Number: 2 (DW_TAG_member)
    <927>   DW_AT_name        : (indirect string, offset: 0x169df): NbrOfDiscConversion
    <92b>   DW_AT_decl_file   : 9
    <92c>   DW_AT_decl_line   : 93
    <92d>   DW_AT_decl_column : 12
    <92e>   DW_AT_type        : <0x22d>
    <932>   DW_AT_data_member_location: 32
 <2><933>: Abbrev Number: 2 (DW_TAG_member)
    <934>   DW_AT_name        : (indirect string, offset: 0x72d41): ExternalTrigConv
    <938>   DW_AT_decl_file   : 9
    <939>   DW_AT_decl_line   : 96
    <93a>   DW_AT_decl_column : 12
    <93b>   DW_AT_type        : <0x22d>
    <93f>   DW_AT_data_member_location: 36
 <2><940>: Abbrev Number: 2 (DW_TAG_member)
    <941>   DW_AT_name        : (indirect string, offset: 0x2ad91): ExternalTrigConvEdge
    <945>   DW_AT_decl_file   : 9
    <946>   DW_AT_decl_line   : 100
    <947>   DW_AT_decl_column : 12
    <948>   DW_AT_type        : <0x22d>
    <94c>   DW_AT_data_member_location: 40
 <2><94d>: Abbrev Number: 2 (DW_TAG_member)
    <94e>   DW_AT_name        : (indirect string, offset: 0x3e769): DMAContinuousRequests
    <952>   DW_AT_decl_file   : 9
    <953>   DW_AT_decl_line   : 103
    <954>   DW_AT_decl_column : 19
    <955>   DW_AT_type        : <0x618>
    <959>   DW_AT_data_member_location: 44
 <2><95a>: Abbrev Number: 0
 <1><95b>: Abbrev Number: 4 (DW_TAG_typedef)
    <95c>   DW_AT_name        : (indirect string, offset: 0x24af1): ADC_InitTypeDef
    <960>   DW_AT_decl_file   : 9
    <961>   DW_AT_decl_line   : 108
    <962>   DW_AT_decl_column : 3
    <963>   DW_AT_type        : <0x8b6>
 <1><967>: Abbrev Number: 10 (DW_TAG_structure_type)
    <968>   DW_AT_byte_size   : 16
    <969>   DW_AT_decl_file   : 9
    <96a>   DW_AT_decl_line   : 117
    <96b>   DW_AT_decl_column : 9
    <96b>   DW_AT_sibling     : <0x9a4>
 <2><96f>: Abbrev Number: 2 (DW_TAG_member)
    <970>   DW_AT_name        : (indirect string, offset: 0xa7a9f): Channel
    <974>   DW_AT_decl_file   : 9
    <975>   DW_AT_decl_line   : 119
    <976>   DW_AT_decl_column : 12
    <977>   DW_AT_type        : <0x22d>
    <97b>   DW_AT_data_member_location: 0
 <2><97c>: Abbrev Number: 2 (DW_TAG_member)
    <97d>   DW_AT_name        : (indirect string, offset: 0xa7b00): Rank
    <981>   DW_AT_decl_file   : 9
    <982>   DW_AT_decl_line   : 121
    <983>   DW_AT_decl_column : 12
    <984>   DW_AT_type        : <0x22d>
    <988>   DW_AT_data_member_location: 4
 <2><989>: Abbrev Number: 2 (DW_TAG_member)
    <98a>   DW_AT_name        : (indirect string, offset: 0xa7c95): SamplingTime
    <98e>   DW_AT_decl_file   : 9
    <98f>   DW_AT_decl_line   : 123
    <990>   DW_AT_decl_column : 12
    <991>   DW_AT_type        : <0x22d>
    <995>   DW_AT_data_member_location: 8
 <2><996>: Abbrev Number: 2 (DW_TAG_member)
    <997>   DW_AT_name        : (indirect string, offset: 0xa7aaf): Offset
    <99b>   DW_AT_decl_file   : 9
    <99c>   DW_AT_decl_line   : 132
    <99d>   DW_AT_decl_column : 12
    <99e>   DW_AT_type        : <0x22d>
    <9a2>   DW_AT_data_member_location: 12
 <2><9a3>: Abbrev Number: 0
 <1><9a4>: Abbrev Number: 4 (DW_TAG_typedef)
    <9a5>   DW_AT_name        : (indirect string, offset: 0x9e753): ADC_ChannelConfTypeDef
    <9a9>   DW_AT_decl_file   : 9
    <9aa>   DW_AT_decl_line   : 133
    <9ab>   DW_AT_decl_column : 3
    <9ac>   DW_AT_type        : <0x967>
 <1><9b0>: Abbrev Number: 10 (DW_TAG_structure_type)
    <9b1>   DW_AT_byte_size   : 72
    <9b2>   DW_AT_decl_file   : 9
    <9b3>   DW_AT_decl_line   : 195
    <9b4>   DW_AT_decl_column : 9
    <9b4>   DW_AT_sibling     : <0xa14>
 <2><9b8>: Abbrev Number: 2 (DW_TAG_member)
    <9b9>   DW_AT_name        : (indirect string, offset: 0x3d10f): Instance
    <9bd>   DW_AT_decl_file   : 9
    <9be>   DW_AT_decl_line   : 198
    <9bf>   DW_AT_decl_column : 34
    <9c0>   DW_AT_type        : <0xa14>
    <9c4>   DW_AT_data_member_location: 0
 <2><9c5>: Abbrev Number: 2 (DW_TAG_member)
    <9c6>   DW_AT_name        : (indirect string, offset: 0xa9210): Init
    <9ca>   DW_AT_decl_file   : 9
    <9cb>   DW_AT_decl_line   : 200
    <9cc>   DW_AT_decl_column : 33
    <9cd>   DW_AT_type        : <0x95b>
    <9d1>   DW_AT_data_member_location: 4
 <2><9d2>: Abbrev Number: 2 (DW_TAG_member)
    <9d3>   DW_AT_name        : (indirect string, offset: 0x2870b): NbrOfCurrentConversionRank
    <9d7>   DW_AT_decl_file   : 9
    <9d8>   DW_AT_decl_line   : 202
    <9d9>   DW_AT_decl_column : 33
    <9da>   DW_AT_type        : <0x239>
    <9de>   DW_AT_data_member_location: 52
 <2><9df>: Abbrev Number: 2 (DW_TAG_member)
    <9e0>   DW_AT_name        : (indirect string, offset: 0x1a65): DMA_Handle
    <9e4>   DW_AT_decl_file   : 9
    <9e5>   DW_AT_decl_line   : 204
    <9e6>   DW_AT_decl_column : 34
    <9e7>   DW_AT_type        : <0xa19>
    <9eb>   DW_AT_data_member_location: 56
 <2><9ec>: Abbrev Number: 2 (DW_TAG_member)
    <9ed>   DW_AT_name        : (indirect string, offset: 0x716d1): Lock
    <9f1>   DW_AT_decl_file   : 9
    <9f2>   DW_AT_decl_line   : 206
    <9f3>   DW_AT_decl_column : 33
    <9f4>   DW_AT_type        : <0x675>
    <9f8>   DW_AT_data_member_location: 60
 <2><9f9>: Abbrev Number: 2 (DW_TAG_member)
    <9fa>   DW_AT_name        : (indirect string, offset: 0xa29ad): State
    <9fe>   DW_AT_decl_file   : 9
    <9ff>   DW_AT_decl_line   : 208
    <a00>   DW_AT_decl_column : 33
    <a01>   DW_AT_type        : <0x239>
    <a05>   DW_AT_data_member_location: 64
 <2><a06>: Abbrev Number: 2 (DW_TAG_member)
    <a07>   DW_AT_name        : (indirect string, offset: 0xaa0ab): ErrorCode
    <a0b>   DW_AT_decl_file   : 9
    <a0c>   DW_AT_decl_line   : 210
    <a0d>   DW_AT_decl_column : 33
    <a0e>   DW_AT_type        : <0x239>
    <a12>   DW_AT_data_member_location: 68
 <2><a13>: Abbrev Number: 0
 <1><a14>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <a15>   DW_AT_byte_size   : 4
    <a15>   DW_AT_type        : <0x369>
 <1><a19>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <a1a>   DW_AT_byte_size   : 4
    <a1a>   DW_AT_type        : <0x8aa>
 <1><a1e>: Abbrev Number: 4 (DW_TAG_typedef)
    <a1f>   DW_AT_name        : (indirect string, offset: 0x1f429): ADC_HandleTypeDef
    <a23>   DW_AT_decl_file   : 9
    <a24>   DW_AT_decl_line   : 220
    <a25>   DW_AT_decl_column : 3
    <a26>   DW_AT_type        : <0x9b0>
 <1><a2a>: Abbrev Number: 14 (DW_TAG_array_type)
    <a2b>   DW_AT_type        : <0x221>
    <a2f>   DW_AT_sibling     : <0xa3a>
 <2><a33>: Abbrev Number: 15 (DW_TAG_subrange_type)
    <a34>   DW_AT_type        : <0x21a>
    <a38>   DW_AT_upper_bound : 3
 <2><a39>: Abbrev Number: 0
 <1><a3a>: Abbrev Number: 32 (DW_TAG_variable)
    <a3b>   DW_AT_name        : avs
    <a3f>   DW_AT_decl_file   : 10
    <a40>   DW_AT_decl_line   : 47
    <a41>   DW_AT_decl_column : 17
    <a42>   DW_AT_type        : <0xa2a>
    <a46>   DW_AT_external    : 1
    <a46>   DW_AT_declaration : 1
 <1><a46>: Abbrev Number: 23 (DW_TAG_variable)
    <a47>   DW_AT_name        : (indirect string, offset: 0x4b276): cpu_temp
    <a4b>   DW_AT_decl_file   : 10
    <a4c>   DW_AT_decl_line   : 48
    <a4d>   DW_AT_decl_column : 14
    <a4e>   DW_AT_type        : <0xa52>
    <a52>   DW_AT_external    : 1
    <a52>   DW_AT_declaration : 1
 <1><a52>: Abbrev Number: 6 (DW_TAG_base_type)
    <a53>   DW_AT_byte_size   : 4
    <a54>   DW_AT_encoding    : 4	(float)
    <a55>   DW_AT_name        : (indirect string, offset: 0xa35d2): float
 <1><a59>: Abbrev Number: 23 (DW_TAG_variable)
    <a5a>   DW_AT_name        : (indirect string, offset: 0x3ffd6): hadc1
    <a5e>   DW_AT_decl_file   : 11
    <a5f>   DW_AT_decl_line   : 35
    <a60>   DW_AT_decl_column : 26
    <a61>   DW_AT_type        : <0xa1e>
    <a65>   DW_AT_external    : 1
    <a65>   DW_AT_declaration : 1
 <1><a65>: Abbrev Number: 18 (DW_TAG_variable)
    <a66>   DW_AT_specification: <0xa3a>
    <a6a>   DW_AT_decl_file   : 1
    <a6a>   DW_AT_decl_line   : 26
    <a6b>   DW_AT_decl_column : 10
    <a6c>   DW_AT_location    : 5 byte block: 3 f0 1 0 20 	(DW_OP_addr: 200001f0)
 <1><a72>: Abbrev Number: 18 (DW_TAG_variable)
    <a73>   DW_AT_specification: <0xa46>
    <a77>   DW_AT_decl_file   : 1
    <a77>   DW_AT_decl_line   : 27
    <a78>   DW_AT_decl_column : 7
    <a79>   DW_AT_location    : 5 byte block: 3 0 0 0 0 	(DW_OP_addr: 0)
 <1><a7f>: Abbrev Number: 18 (DW_TAG_variable)
    <a80>   DW_AT_specification: <0xa59>
    <a84>   DW_AT_decl_file   : 1
    <a84>   DW_AT_decl_line   : 31
    <a85>   DW_AT_decl_column : 19
    <a86>   DW_AT_location    : 5 byte block: 3 f8 1 0 20 	(DW_OP_addr: 200001f8)
 <1><a8c>: Abbrev Number: 33 (DW_TAG_variable)
    <a8d>   DW_AT_name        : (indirect string, offset: 0x8dc7f): hdma_adc1
    <a91>   DW_AT_decl_file   : 1
    <a92>   DW_AT_decl_line   : 32
    <a93>   DW_AT_decl_column : 19
    <a94>   DW_AT_type        : <0x8aa>
    <a98>   DW_AT_external    : 1
    <a98>   DW_AT_location    : 5 byte block: 3 40 2 0 20 	(DW_OP_addr: 20000240)
 <1><a9e>: Abbrev Number: 19 (DW_TAG_subprogram)
    <a9f>   DW_AT_external    : 1
    <a9f>   DW_AT_name        : (indirect string, offset: 0x9da60): HAL_NVIC_DisableIRQ
    <aa3>   DW_AT_decl_file   : 12
    <aa3>   DW_AT_decl_line   : 263
    <aa5>   DW_AT_decl_column : 6
    <aa5>   DW_AT_prototyped  : 1
    <aa5>   DW_AT_declaration : 1
    <aa5>   DW_AT_sibling     : <0xaaf>
 <2><aa9>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <aaa>   DW_AT_type        : <0x1be>
 <2><aae>: Abbrev Number: 0
 <1><aaf>: Abbrev Number: 16 (DW_TAG_subprogram)
    <ab0>   DW_AT_external    : 1
    <ab0>   DW_AT_name        : (indirect string, offset: 0x1b402): HAL_DMA_DeInit
    <ab4>   DW_AT_decl_file   : 8
    <ab5>   DW_AT_decl_line   : 653
    <ab7>   DW_AT_decl_column : 19
    <ab7>   DW_AT_prototyped  : 1
    <ab7>   DW_AT_type        : <0x650>
    <abb>   DW_AT_declaration : 1
    <abb>   DW_AT_sibling     : <0xac5>
 <2><abf>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <ac0>   DW_AT_type        : <0xa19>
 <2><ac4>: Abbrev Number: 0
 <1><ac5>: Abbrev Number: 24 (DW_TAG_subprogram)
    <ac6>   DW_AT_external    : 1
    <ac6>   DW_AT_name        : (indirect string, offset: 0x8a469): HAL_GPIO_DeInit
    <aca>   DW_AT_decl_file   : 7
    <aca>   DW_AT_decl_line   : 225
    <acb>   DW_AT_decl_column : 7
    <acb>   DW_AT_prototyped  : 1
    <acb>   DW_AT_declaration : 1
    <acb>   DW_AT_sibling     : <0xada>
 <2><acf>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <ad0>   DW_AT_type        : <0xada>
 <2><ad4>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <ad5>   DW_AT_type        : <0x22d>
 <2><ad9>: Abbrev Number: 0
 <1><ada>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <adb>   DW_AT_byte_size   : 4
    <adb>   DW_AT_type        : <0x461>
 <1><adf>: Abbrev Number: 19 (DW_TAG_subprogram)
    <ae0>   DW_AT_external    : 1
    <ae0>   DW_AT_name        : (indirect string, offset: 0x13066): HAL_NVIC_EnableIRQ
    <ae4>   DW_AT_decl_file   : 12
    <ae4>   DW_AT_decl_line   : 262
    <ae6>   DW_AT_decl_column : 6
    <ae6>   DW_AT_prototyped  : 1
    <ae6>   DW_AT_declaration : 1
    <ae6>   DW_AT_sibling     : <0xaf0>
 <2><aea>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <aeb>   DW_AT_type        : <0x1be>
 <2><aef>: Abbrev Number: 0
 <1><af0>: Abbrev Number: 19 (DW_TAG_subprogram)
    <af1>   DW_AT_external    : 1
    <af1>   DW_AT_name        : (indirect string, offset: 0x840dc): HAL_NVIC_SetPriority
    <af5>   DW_AT_decl_file   : 12
    <af5>   DW_AT_decl_line   : 261
    <af7>   DW_AT_decl_column : 6
    <af7>   DW_AT_prototyped  : 1
    <af7>   DW_AT_declaration : 1
    <af7>   DW_AT_sibling     : <0xb0b>
 <2><afb>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <afc>   DW_AT_type        : <0x1be>
 <2><b00>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <b01>   DW_AT_type        : <0x22d>
 <2><b05>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <b06>   DW_AT_type        : <0x22d>
 <2><b0a>: Abbrev Number: 0
 <1><b0b>: Abbrev Number: 16 (DW_TAG_subprogram)
    <b0c>   DW_AT_external    : 1
    <b0c>   DW_AT_name        : (indirect string, offset: 0x92fd4): HAL_DMA_Init
    <b10>   DW_AT_decl_file   : 8
    <b11>   DW_AT_decl_line   : 652
    <b13>   DW_AT_decl_column : 19
    <b13>   DW_AT_prototyped  : 1
    <b13>   DW_AT_type        : <0x650>
    <b17>   DW_AT_declaration : 1
    <b17>   DW_AT_sibling     : <0xb21>
 <2><b1b>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <b1c>   DW_AT_type        : <0xa19>
 <2><b20>: Abbrev Number: 0
 <1><b21>: Abbrev Number: 24 (DW_TAG_subprogram)
    <b22>   DW_AT_external    : 1
    <b22>   DW_AT_name        : (indirect string, offset: 0x61803): HAL_GPIO_Init
    <b26>   DW_AT_decl_file   : 7
    <b26>   DW_AT_decl_line   : 224
    <b27>   DW_AT_decl_column : 7
    <b27>   DW_AT_prototyped  : 1
    <b27>   DW_AT_declaration : 1
    <b27>   DW_AT_sibling     : <0xb36>
 <2><b2b>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <b2c>   DW_AT_type        : <0xada>
 <2><b30>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <b31>   DW_AT_type        : <0xb36>
 <2><b35>: Abbrev Number: 0
 <1><b36>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <b37>   DW_AT_byte_size   : 4
    <b37>   DW_AT_type        : <0x6cb>
 <1><b3b>: Abbrev Number: 16 (DW_TAG_subprogram)
    <b3c>   DW_AT_external    : 1
    <b3c>   DW_AT_name        : (indirect string, offset: 0x2d95f): HAL_ADC_ConfigChannel
    <b40>   DW_AT_decl_file   : 9
    <b41>   DW_AT_decl_line   : 611
    <b43>   DW_AT_decl_column : 19
    <b43>   DW_AT_prototyped  : 1
    <b43>   DW_AT_type        : <0x650>
    <b47>   DW_AT_declaration : 1
    <b47>   DW_AT_sibling     : <0xb56>
 <2><b4b>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <b4c>   DW_AT_type        : <0xb56>
 <2><b50>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <b51>   DW_AT_type        : <0xb5b>
 <2><b55>: Abbrev Number: 0
 <1><b56>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <b57>   DW_AT_byte_size   : 4
    <b57>   DW_AT_type        : <0xa1e>
 <1><b5b>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <b5c>   DW_AT_byte_size   : 4
    <b5c>   DW_AT_type        : <0x9a4>
 <1><b60>: Abbrev Number: 34 (DW_TAG_subprogram)
    <b61>   DW_AT_external    : 1
    <b61>   DW_AT_name        : (indirect string, offset: 0x45712): Error_Handler
    <b65>   DW_AT_decl_file   : 13
    <b66>   DW_AT_decl_line   : 53
    <b67>   DW_AT_decl_column : 6
    <b68>   DW_AT_prototyped  : 1
    <b68>   DW_AT_declaration : 1
 <1><b68>: Abbrev Number: 16 (DW_TAG_subprogram)
    <b69>   DW_AT_external    : 1
    <b69>   DW_AT_name        : (indirect string, offset: 0xcb2e): HAL_ADC_Init
    <b6d>   DW_AT_decl_file   : 9
    <b6e>   DW_AT_decl_line   : 565
    <b70>   DW_AT_decl_column : 19
    <b70>   DW_AT_prototyped  : 1
    <b70>   DW_AT_type        : <0x650>
    <b74>   DW_AT_declaration : 1
    <b74>   DW_AT_sibling     : <0xb7e>
 <2><b78>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <b79>   DW_AT_type        : <0xb56>
 <2><b7d>: Abbrev Number: 0
 <1><b7e>: Abbrev Number: 35 (DW_TAG_subprogram)
    <b7f>   DW_AT_external    : 1
    <b7f>   DW_AT_name        : (indirect string, offset: 0x4b272): get_cpu_temp
    <b83>   DW_AT_decl_file   : 1
    <b84>   DW_AT_decl_line   : 200
    <b85>   DW_AT_decl_column : 7
    <b86>   DW_AT_prototyped  : 1
    <b86>   DW_AT_type        : <0xa52>
    <b8a>   DW_AT_low_pc      : 0x8001228
    <b8e>   DW_AT_high_pc     : 0x9c
    <b92>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <b94>   DW_AT_call_all_tail_calls: 1
    <b94>   DW_AT_sibling     : <0xbb5>
 <2><b98>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <b99>   DW_AT_name        : (indirect string, offset: 0x17c8a): cpu_temp_value
    <b9d>   DW_AT_decl_file   : 1
    <b9d>   DW_AT_decl_line   : 200
    <b9e>   DW_AT_decl_column : 29
    <b9f>   DW_AT_type        : <0x221>
    <ba3>   DW_AT_location    : 2 byte block: 91 6e 	(DW_OP_fbreg: -18)
 <2><ba6>: Abbrev Number: 12 (DW_TAG_variable)
    <ba7>   DW_AT_name        : (indirect string, offset: 0x42e08): temp_sense
    <bab>   DW_AT_decl_file   : 1
    <bab>   DW_AT_decl_line   : 201
    <bac>   DW_AT_decl_column : 8
    <bad>   DW_AT_type        : <0xa52>
    <bb1>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><bb4>: Abbrev Number: 0
 <1><bb5>: Abbrev Number: 25 (DW_TAG_subprogram)
    <bb6>   DW_AT_external    : 1
    <bb6>   DW_AT_name        : (indirect string, offset: 0x82a3): HAL_ADC_MspDeInit
    <bba>   DW_AT_decl_file   : 1
    <bba>   DW_AT_decl_line   : 167
    <bbb>   DW_AT_decl_column : 6
    <bbb>   DW_AT_prototyped  : 1
    <bbb>   DW_AT_low_pc      : 0
    <bbf>   DW_AT_high_pc     : 0x58
    <bc3>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <bc5>   DW_AT_call_all_tail_calls: 1
    <bc5>   DW_AT_sibling     : <0xbd8>
 <2><bc9>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <bca>   DW_AT_name        : (indirect string, offset: 0x55bb9): adcHandle
    <bce>   DW_AT_decl_file   : 1
    <bce>   DW_AT_decl_line   : 167
    <bcf>   DW_AT_decl_column : 43
    <bd0>   DW_AT_type        : <0xb56>
    <bd4>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><bd7>: Abbrev Number: 0
 <1><bd8>: Abbrev Number: 25 (DW_TAG_subprogram)
    <bd9>   DW_AT_external    : 1
    <bd9>   DW_AT_name        : (indirect string, offset: 0x1347f): HAL_ADC_MspInit
    <bdd>   DW_AT_decl_file   : 1
    <bdd>   DW_AT_decl_line   : 110
    <bde>   DW_AT_decl_column : 6
    <bde>   DW_AT_prototyped  : 1
    <bde>   DW_AT_low_pc      : 0x80010f0
    <be2>   DW_AT_high_pc     : 0x138
    <be6>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <be8>   DW_AT_call_all_tail_calls: 1
    <be8>   DW_AT_sibling     : <0xc59>
 <2><bec>: Abbrev Number: 20 (DW_TAG_formal_parameter)
    <bed>   DW_AT_name        : (indirect string, offset: 0x55bb9): adcHandle
    <bf1>   DW_AT_decl_file   : 1
    <bf1>   DW_AT_decl_line   : 110
    <bf2>   DW_AT_decl_column : 41
    <bf3>   DW_AT_type        : <0xb56>
    <bf7>   DW_AT_location    : 2 byte block: 91 54 	(DW_OP_fbreg: -44)
 <2><bfa>: Abbrev Number: 12 (DW_TAG_variable)
    <bfb>   DW_AT_name        : (indirect string, offset: 0xeefc): GPIO_InitStruct
    <bff>   DW_AT_decl_file   : 1
    <bff>   DW_AT_decl_line   : 113
    <c00>   DW_AT_decl_column : 20
    <c01>   DW_AT_type        : <0x6cb>
    <c05>   DW_AT_location    : 2 byte block: 91 64 	(DW_OP_fbreg: -28)
 <2><c08>: Abbrev Number: 26 (DW_TAG_lexical_block)
    <c09>   DW_AT_low_pc      : 0x8001112
    <c0d>   DW_AT_high_pc     : 0x1c
    <c11>   DW_AT_sibling     : <0xc24>
 <3><c15>: Abbrev Number: 12 (DW_TAG_variable)
    <c16>   DW_AT_name        : (indirect string, offset: 0xa9281): tmpreg
    <c1a>   DW_AT_decl_file   : 1
    <c1a>   DW_AT_decl_line   : 120
    <c1b>   DW_AT_decl_column : 5
    <c1c>   DW_AT_type        : <0x239>
    <c20>   DW_AT_location    : 2 byte block: 91 60 	(DW_OP_fbreg: -32)
 <3><c23>: Abbrev Number: 0
 <2><c24>: Abbrev Number: 26 (DW_TAG_lexical_block)
    <c25>   DW_AT_low_pc      : 0x800112e
    <c29>   DW_AT_high_pc     : 0x1c
    <c2d>   DW_AT_sibling     : <0xc40>
 <3><c31>: Abbrev Number: 12 (DW_TAG_variable)
    <c32>   DW_AT_name        : (indirect string, offset: 0xa9281): tmpreg
    <c36>   DW_AT_decl_file   : 1
    <c36>   DW_AT_decl_line   : 122
    <c37>   DW_AT_decl_column : 5
    <c38>   DW_AT_type        : <0x239>
    <c3c>   DW_AT_location    : 2 byte block: 91 5c 	(DW_OP_fbreg: -36)
 <3><c3f>: Abbrev Number: 0
 <2><c40>: Abbrev Number: 36 (DW_TAG_lexical_block)
    <c41>   DW_AT_low_pc      : 0x800114a
    <c45>   DW_AT_high_pc     : 0x1c
 <3><c49>: Abbrev Number: 12 (DW_TAG_variable)
    <c4a>   DW_AT_name        : (indirect string, offset: 0xa9281): tmpreg
    <c4e>   DW_AT_decl_file   : 1
    <c4e>   DW_AT_decl_line   : 123
    <c4f>   DW_AT_decl_column : 5
    <c50>   DW_AT_type        : <0x239>
    <c54>   DW_AT_location    : 2 byte block: 91 58 	(DW_OP_fbreg: -40)
 <3><c57>: Abbrev Number: 0
 <2><c58>: Abbrev Number: 0
 <1><c59>: Abbrev Number: 37 (DW_TAG_subprogram)
    <c5a>   DW_AT_external    : 1
    <c5a>   DW_AT_name        : (indirect string, offset: 0x621e6): MX_ADC1_Init
    <c5e>   DW_AT_decl_file   : 1
    <c5f>   DW_AT_decl_line   : 35
    <c60>   DW_AT_decl_column : 6
    <c61>   DW_AT_prototyped  : 1
    <c61>   DW_AT_low_pc      : 0x8000ff4
    <c65>   DW_AT_high_pc     : 0xfc
    <c69>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <c6b>   DW_AT_call_all_tail_calls: 1
 <2><c6b>: Abbrev Number: 12 (DW_TAG_variable)
    <c6c>   DW_AT_name        : (indirect string, offset: 0x979f2): sConfig
    <c70>   DW_AT_decl_file   : 1
    <c70>   DW_AT_decl_line   : 42
    <c71>   DW_AT_decl_column : 26
    <c72>   DW_AT_type        : <0x9a4>
    <c76>   DW_AT_location    : 2 byte block: 91 68 	(DW_OP_fbreg: -24)
 <2><c79>: Abbrev Number: 0
 <1><c7a>: Abbrev Number: 0
  Compilation Unit @ offset 0xc7b:
   Length:        0x43b (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0x254
   Pointer Size:  4
 <0><c87>: Abbrev Number: 11 (DW_TAG_compile_unit)
    <c88>   DW_AT_producer    : (indirect string, offset: 0x3a6a4): GNU C11 12.3.1 20230626 -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <c8c>   DW_AT_language    : 29	(C11)
    <c8d>   DW_AT_name        : (indirect string, offset: 0x9fa7b): ../Core/Src/dma.c
    <c91>   DW_AT_comp_dir    : (indirect string, offset: 0x2c8d4): /Users/alybadawy/repos/Vexuf-Project/Firmwares/Horus/Debug
    <c95>   DW_AT_ranges      : 0x34
    <c99>   DW_AT_low_pc      : 0
    <c9d>   DW_AT_stmt_list   : 0x8ed
    <ca1>   DW_AT_macros      : 0x313
 <1><ca5>: Abbrev Number: 12 (DW_TAG_enumeration_type)
    <ca6>   DW_AT_encoding    : 5	(signed)
    <ca7>   DW_AT_byte_size   : 1
    <ca8>   DW_AT_type        : <0xe34>
    <cac>   DW_AT_decl_file   : 2
    <cad>   DW_AT_decl_line   : 66
    <cae>   DW_AT_decl_column : 1
    <caf>   DW_AT_sibling     : <0xe34>
 <2><cb3>: Abbrev Number: 4 (DW_TAG_enumerator)
    <cb4>   DW_AT_name        : (indirect string, offset: 0x8d58a): NonMaskableInt_IRQn
    <cb8>   DW_AT_const_value : -14
 <2><cb9>: Abbrev Number: 4 (DW_TAG_enumerator)
    <cba>   DW_AT_name        : (indirect string, offset: 0x65478): MemoryManagement_IRQn
    <cbe>   DW_AT_const_value : -12
 <2><cbf>: Abbrev Number: 4 (DW_TAG_enumerator)
    <cc0>   DW_AT_name        : (indirect string, offset: 0x7b463): BusFault_IRQn
    <cc4>   DW_AT_const_value : -11
 <2><cc5>: Abbrev Number: 4 (DW_TAG_enumerator)
    <cc6>   DW_AT_name        : (indirect string, offset: 0x8d16a): UsageFault_IRQn
    <cca>   DW_AT_const_value : -10
 <2><ccb>: Abbrev Number: 4 (DW_TAG_enumerator)
    <ccc>   DW_AT_name        : (indirect string, offset: 0x1ae5): SVCall_IRQn
    <cd0>   DW_AT_const_value : -5
 <2><cd1>: Abbrev Number: 4 (DW_TAG_enumerator)
    <cd2>   DW_AT_name        : (indirect string, offset: 0x4e2f0): DebugMonitor_IRQn
    <cd6>   DW_AT_const_value : -4
 <2><cd7>: Abbrev Number: 4 (DW_TAG_enumerator)
    <cd8>   DW_AT_name        : (indirect string, offset: 0x56646): PendSV_IRQn
    <cdc>   DW_AT_const_value : -2
 <2><cdd>: Abbrev Number: 4 (DW_TAG_enumerator)
    <cde>   DW_AT_name        : (indirect string, offset: 0x7f646): SysTick_IRQn
    <ce2>   DW_AT_const_value : -1
 <2><ce3>: Abbrev Number: 1 (DW_TAG_enumerator)
    <ce4>   DW_AT_name        : (indirect string, offset: 0x6b921): WWDG_IRQn
    <ce8>   DW_AT_const_value : 0
 <2><ce9>: Abbrev Number: 1 (DW_TAG_enumerator)
    <cea>   DW_AT_name        : (indirect string, offset: 0x172ce): PVD_IRQn
    <cee>   DW_AT_const_value : 1
 <2><cef>: Abbrev Number: 1 (DW_TAG_enumerator)
    <cf0>   DW_AT_name        : (indirect string, offset: 0x98436): TAMP_STAMP_IRQn
    <cf4>   DW_AT_const_value : 2
 <2><cf5>: Abbrev Number: 1 (DW_TAG_enumerator)
    <cf6>   DW_AT_name        : (indirect string, offset: 0x5df19): RTC_WKUP_IRQn
    <cfa>   DW_AT_const_value : 3
 <2><cfb>: Abbrev Number: 1 (DW_TAG_enumerator)
    <cfc>   DW_AT_name        : (indirect string, offset: 0x2178e): FLASH_IRQn
    <d00>   DW_AT_const_value : 4
 <2><d01>: Abbrev Number: 1 (DW_TAG_enumerator)
    <d02>   DW_AT_name        : (indirect string, offset: 0x7ad70): RCC_IRQn
    <d06>   DW_AT_const_value : 5
 <2><d07>: Abbrev Number: 1 (DW_TAG_enumerator)
    <d08>   DW_AT_name        : (indirect string, offset: 0x4e392): EXTI0_IRQn
    <d0c>   DW_AT_const_value : 6
 <2><d0d>: Abbrev Number: 1 (DW_TAG_enumerator)
    <d0e>   DW_AT_name        : (indirect string, offset: 0x96eb8): EXTI1_IRQn
    <d12>   DW_AT_const_value : 7
 <2><d13>: Abbrev Number: 1 (DW_TAG_enumerator)
    <d14>   DW_AT_name        : (indirect string, offset: 0x465bf): EXTI2_IRQn
    <d18>   DW_AT_const_value : 8
 <2><d19>: Abbrev Number: 1 (DW_TAG_enumerator)
    <d1a>   DW_AT_name        : (indirect string, offset: 0x80dee): EXTI3_IRQn
    <d1e>   DW_AT_const_value : 9
 <2><d1f>: Abbrev Number: 1 (DW_TAG_enumerator)
    <d20>   DW_AT_name        : (indirect string, offset: 0x28c17): EXTI4_IRQn
    <d24>   DW_AT_const_value : 10
 <2><d25>: Abbrev Number: 1 (DW_TAG_enumerator)
    <d26>   DW_AT_name        : (indirect string, offset: 0x12a83): DMA1_Stream0_IRQn
    <d2a>   DW_AT_const_value : 11
 <2><d2b>: Abbrev Number: 1 (DW_TAG_enumerator)
    <d2c>   DW_AT_name        : (indirect string, offset: 0x9b9a5): DMA1_Stream1_IRQn
    <d30>   DW_AT_const_value : 12
 <2><d31>: Abbrev Number: 1 (DW_TAG_enumerator)
    <d32>   DW_AT_name        : (indirect string, offset: 0x42af5): DMA1_Stream2_IRQn
    <d36>   DW_AT_const_value : 13
 <2><d37>: Abbrev Number: 1 (DW_TAG_enumerator)
    <d38>   DW_AT_name        : (indirect string, offset: 0x2e168): DMA1_Stream3_IRQn
    <d3c>   DW_AT_const_value : 14
 <2><d3d>: Abbrev Number: 1 (DW_TAG_enumerator)
    <d3e>   DW_AT_name        : (indirect string, offset: 0x2d345): DMA1_Stream4_IRQn
    <d42>   DW_AT_const_value : 15
 <2><d43>: Abbrev Number: 1 (DW_TAG_enumerator)
    <d44>   DW_AT_name        : (indirect string, offset: 0x76a1d): DMA1_Stream5_IRQn
    <d48>   DW_AT_const_value : 16
 <2><d49>: Abbrev Number: 1 (DW_TAG_enumerator)
    <d4a>   DW_AT_name        : (indirect string, offset: 0x1ead9): DMA1_Stream6_IRQn
    <d4e>   DW_AT_const_value : 17
 <2><d4f>: Abbrev Number: 1 (DW_TAG_enumerator)
    <d50>   DW_AT_name        : (indirect string, offset: 0x4f22a): ADC_IRQn
    <d54>   DW_AT_const_value : 18
 <2><d55>: Abbrev Number: 1 (DW_TAG_enumerator)
    <d56>   DW_AT_name        : (indirect string, offset: 0x70d1): EXTI9_5_IRQn
    <d5a>   DW_AT_const_value : 23
 <2><d5b>: Abbrev Number: 1 (DW_TAG_enumerator)
    <d5c>   DW_AT_name        : (indirect string, offset: 0x401b7): TIM1_BRK_TIM9_IRQn
    <d60>   DW_AT_const_value : 24
 <2><d61>: Abbrev Number: 1 (DW_TAG_enumerator)
    <d62>   DW_AT_name        : (indirect string, offset: 0x5b473): TIM1_UP_TIM10_IRQn
    <d66>   DW_AT_const_value : 25
 <2><d67>: Abbrev Number: 1 (DW_TAG_enumerator)
    <d68>   DW_AT_name        : (indirect string, offset: 0x6e6f5): TIM1_TRG_COM_TIM11_IRQn
    <d6c>   DW_AT_const_value : 26
 <2><d6d>: Abbrev Number: 1 (DW_TAG_enumerator)
    <d6e>   DW_AT_name        : (indirect string, offset: 0x3184d): TIM1_CC_IRQn
    <d72>   DW_AT_const_value : 27
 <2><d73>: Abbrev Number: 1 (DW_TAG_enumerator)
    <d74>   DW_AT_name        : (indirect string, offset: 0x11977): TIM2_IRQn
    <d78>   DW_AT_const_value : 28
 <2><d79>: Abbrev Number: 1 (DW_TAG_enumerator)
    <d7a>   DW_AT_name        : (indirect string, offset: 0x90d7c): TIM3_IRQn
    <d7e>   DW_AT_const_value : 29
 <2><d7f>: Abbrev Number: 1 (DW_TAG_enumerator)
    <d80>   DW_AT_name        : (indirect string, offset: 0x33f5e): TIM4_IRQn
    <d84>   DW_AT_const_value : 30
 <2><d85>: Abbrev Number: 1 (DW_TAG_enumerator)
    <d86>   DW_AT_name        : (indirect string, offset: 0x35266): I2C1_EV_IRQn
    <d8a>   DW_AT_const_value : 31
 <2><d8b>: Abbrev Number: 1 (DW_TAG_enumerator)
    <d8c>   DW_AT_name        : (indirect string, offset: 0x61a0c): I2C1_ER_IRQn
    <d90>   DW_AT_const_value : 32
 <2><d91>: Abbrev Number: 1 (DW_TAG_enumerator)
    <d92>   DW_AT_name        : (indirect string, offset: 0x1153c): I2C2_EV_IRQn
    <d96>   DW_AT_const_value : 33
 <2><d97>: Abbrev Number: 1 (DW_TAG_enumerator)
    <d98>   DW_AT_name        : (indirect string, offset: 0x3d0e9): I2C2_ER_IRQn
    <d9c>   DW_AT_const_value : 34
 <2><d9d>: Abbrev Number: 1 (DW_TAG_enumerator)
    <d9e>   DW_AT_name        : (indirect string, offset: 0x11658): SPI1_IRQn
    <da2>   DW_AT_const_value : 35
 <2><da3>: Abbrev Number: 1 (DW_TAG_enumerator)
    <da4>   DW_AT_name        : (indirect string, offset: 0x6b0d2): SPI2_IRQn
    <da8>   DW_AT_const_value : 36
 <2><da9>: Abbrev Number: 1 (DW_TAG_enumerator)
    <daa>   DW_AT_name        : (indirect string, offset: 0x7c07b): USART1_IRQn
    <dae>   DW_AT_const_value : 37
 <2><daf>: Abbrev Number: 1 (DW_TAG_enumerator)
    <db0>   DW_AT_name        : (indirect string, offset: 0x2403d): USART2_IRQn
    <db4>   DW_AT_const_value : 38
 <2><db5>: Abbrev Number: 1 (DW_TAG_enumerator)
    <db6>   DW_AT_name        : (indirect string, offset: 0x850f9): EXTI15_10_IRQn
    <dba>   DW_AT_const_value : 40
 <2><dbb>: Abbrev Number: 1 (DW_TAG_enumerator)
    <dbc>   DW_AT_name        : (indirect string, offset: 0x8631c): RTC_Alarm_IRQn
    <dc0>   DW_AT_const_value : 41
 <2><dc1>: Abbrev Number: 1 (DW_TAG_enumerator)
    <dc2>   DW_AT_name        : (indirect string, offset: 0x21711): OTG_FS_WKUP_IRQn
    <dc6>   DW_AT_const_value : 42
 <2><dc7>: Abbrev Number: 1 (DW_TAG_enumerator)
    <dc8>   DW_AT_name        : (indirect string, offset: 0x5feda): DMA1_Stream7_IRQn
    <dcc>   DW_AT_const_value : 47
 <2><dcd>: Abbrev Number: 1 (DW_TAG_enumerator)
    <dce>   DW_AT_name        : (indirect string, offset: 0x35b0e): SDIO_IRQn
    <dd2>   DW_AT_const_value : 49
 <2><dd3>: Abbrev Number: 1 (DW_TAG_enumerator)
    <dd4>   DW_AT_name        : (indirect string, offset: 0x42fcb): TIM5_IRQn
    <dd8>   DW_AT_const_value : 50
 <2><dd9>: Abbrev Number: 1 (DW_TAG_enumerator)
    <dda>   DW_AT_name        : (indirect string, offset: 0x9bc28): SPI3_IRQn
    <dde>   DW_AT_const_value : 51
 <2><ddf>: Abbrev Number: 1 (DW_TAG_enumerator)
    <de0>   DW_AT_name        : (indirect string, offset: 0x69428): DMA2_Stream0_IRQn
    <de4>   DW_AT_const_value : 56
 <2><de5>: Abbrev Number: 1 (DW_TAG_enumerator)
    <de6>   DW_AT_name        : (indirect string, offset: 0x1202c): DMA2_Stream1_IRQn
    <dea>   DW_AT_const_value : 57
 <2><deb>: Abbrev Number: 1 (DW_TAG_enumerator)
    <dec>   DW_AT_name        : (indirect string, offset: 0x534a4): DMA2_Stream2_IRQn
    <df0>   DW_AT_const_value : 58
 <2><df1>: Abbrev Number: 1 (DW_TAG_enumerator)
    <df2>   DW_AT_name        : (indirect string, offset: 0x9c569): DMA2_Stream3_IRQn
    <df6>   DW_AT_const_value : 59
 <2><df7>: Abbrev Number: 1 (DW_TAG_enumerator)
    <df8>   DW_AT_name        : (indirect string, offset: 0x43832): DMA2_Stream4_IRQn
    <dfc>   DW_AT_const_value : 60
 <2><dfd>: Abbrev Number: 1 (DW_TAG_enumerator)
    <dfe>   DW_AT_name        : (indirect string, offset: 0x5a9a4): OTG_FS_IRQn
    <e02>   DW_AT_const_value : 67
 <2><e03>: Abbrev Number: 1 (DW_TAG_enumerator)
    <e04>   DW_AT_name        : (indirect string, offset: 0x86340): DMA2_Stream5_IRQn
    <e08>   DW_AT_const_value : 68
 <2><e09>: Abbrev Number: 1 (DW_TAG_enumerator)
    <e0a>   DW_AT_name        : (indirect string, offset: 0x2dfc2): DMA2_Stream6_IRQn
    <e0e>   DW_AT_const_value : 69
 <2><e0f>: Abbrev Number: 1 (DW_TAG_enumerator)
    <e10>   DW_AT_name        : (indirect string, offset: 0x77600): DMA2_Stream7_IRQn
    <e14>   DW_AT_const_value : 70
 <2><e15>: Abbrev Number: 1 (DW_TAG_enumerator)
    <e16>   DW_AT_name        : (indirect string, offset: 0x3ebbf): USART6_IRQn
    <e1a>   DW_AT_const_value : 71
 <2><e1b>: Abbrev Number: 1 (DW_TAG_enumerator)
    <e1c>   DW_AT_name        : (indirect string, offset: 0x8deeb): I2C3_EV_IRQn
    <e20>   DW_AT_const_value : 72
 <2><e21>: Abbrev Number: 1 (DW_TAG_enumerator)
    <e22>   DW_AT_name        : (indirect string, offset: 0x1a072): I2C3_ER_IRQn
    <e26>   DW_AT_const_value : 73
 <2><e27>: Abbrev Number: 1 (DW_TAG_enumerator)
    <e28>   DW_AT_name        : (indirect string, offset: 0xbfe1): FPU_IRQn
    <e2c>   DW_AT_const_value : 81
 <2><e2d>: Abbrev Number: 1 (DW_TAG_enumerator)
    <e2e>   DW_AT_name        : (indirect string, offset: 0x42de2): SPI4_IRQn
    <e32>   DW_AT_const_value : 84
 <2><e33>: Abbrev Number: 0
 <1><e34>: Abbrev Number: 3 (DW_TAG_base_type)
    <e35>   DW_AT_byte_size   : 1
    <e36>   DW_AT_encoding    : 6	(signed char)
    <e37>   DW_AT_name        : (indirect string, offset: 0x4f5ea): signed char
 <1><e3b>: Abbrev Number: 6 (DW_TAG_typedef)
    <e3c>   DW_AT_name        : (indirect string, offset: 0x8b077): IRQn_Type
    <e40>   DW_AT_decl_file   : 2
    <e41>   DW_AT_decl_line   : 133
    <e42>   DW_AT_decl_column : 3
    <e43>   DW_AT_type        : <0xca5>
 <1><e47>: Abbrev Number: 3 (DW_TAG_base_type)
    <e48>   DW_AT_byte_size   : 1
    <e49>   DW_AT_encoding    : 8	(unsigned char)
    <e4a>   DW_AT_name        : (indirect string, offset: 0x1fd87): unsigned char
 <1><e4e>: Abbrev Number: 3 (DW_TAG_base_type)
    <e4f>   DW_AT_byte_size   : 2
    <e50>   DW_AT_encoding    : 5	(signed)
    <e51>   DW_AT_name        : (indirect string, offset: 0x76d1a): short int
 <1><e55>: Abbrev Number: 3 (DW_TAG_base_type)
    <e56>   DW_AT_byte_size   : 2
    <e57>   DW_AT_encoding    : 7	(unsigned)
    <e58>   DW_AT_name        : (indirect string, offset: 0x98670): short unsigned int
 <1><e5c>: Abbrev Number: 3 (DW_TAG_base_type)
    <e5d>   DW_AT_byte_size   : 4
    <e5e>   DW_AT_encoding    : 5	(signed)
    <e5f>   DW_AT_name        : (indirect string, offset: 0xd0e0): long int
 <1><e63>: Abbrev Number: 6 (DW_TAG_typedef)
    <e64>   DW_AT_name        : (indirect string, offset: 0x652fb): __uint32_t
    <e68>   DW_AT_decl_file   : 3
    <e69>   DW_AT_decl_line   : 79
    <e6a>   DW_AT_decl_column : 25
    <e6b>   DW_AT_type        : <0xe6f>
 <1><e6f>: Abbrev Number: 3 (DW_TAG_base_type)
    <e70>   DW_AT_byte_size   : 4
    <e71>   DW_AT_encoding    : 7	(unsigned)
    <e72>   DW_AT_name        : (indirect string, offset: 0x30616): long unsigned int
 <1><e76>: Abbrev Number: 3 (DW_TAG_base_type)
    <e77>   DW_AT_byte_size   : 8
    <e78>   DW_AT_encoding    : 5	(signed)
    <e79>   DW_AT_name        : (indirect string, offset: 0x479eb): long long int
 <1><e7d>: Abbrev Number: 3 (DW_TAG_base_type)
    <e7e>   DW_AT_byte_size   : 8
    <e7f>   DW_AT_encoding    : 7	(unsigned)
    <e80>   DW_AT_name        : (indirect string, offset: 0x207ed): long long unsigned int
 <1><e84>: Abbrev Number: 13 (DW_TAG_base_type)
    <e85>   DW_AT_byte_size   : 4
    <e86>   DW_AT_encoding    : 5	(signed)
    <e87>   DW_AT_name        : int
 <1><e8b>: Abbrev Number: 3 (DW_TAG_base_type)
    <e8c>   DW_AT_byte_size   : 4
    <e8d>   DW_AT_encoding    : 7	(unsigned)
    <e8e>   DW_AT_name        : (indirect string, offset: 0xcaa0): unsigned int
 <1><e92>: Abbrev Number: 6 (DW_TAG_typedef)
    <e93>   DW_AT_name        : (indirect string, offset: 0x652fd): uint32_t
    <e97>   DW_AT_decl_file   : 4
    <e98>   DW_AT_decl_line   : 48
    <e99>   DW_AT_decl_column : 20
    <e9a>   DW_AT_type        : <0xe63>
 <1><e9e>: Abbrev Number: 14 (DW_TAG_volatile_type)
    <e9f>   DW_AT_type        : <0xe92>
 <1><ea3>: Abbrev Number: 8 (DW_TAG_array_type)
    <ea4>   DW_AT_type        : <0xe92>
    <ea8>   DW_AT_sibling     : <0xeb3>
 <2><eac>: Abbrev Number: 9 (DW_TAG_subrange_type)
    <ead>   DW_AT_type        : <0xe8b>
    <eb1>   DW_AT_upper_bound : 0
 <2><eb2>: Abbrev Number: 0
 <1><eb3>: Abbrev Number: 8 (DW_TAG_array_type)
    <eb4>   DW_AT_type        : <0xe92>
    <eb8>   DW_AT_sibling     : <0xec3>
 <2><ebc>: Abbrev Number: 9 (DW_TAG_subrange_type)
    <ebd>   DW_AT_type        : <0xe8b>
    <ec1>   DW_AT_upper_bound : 1
 <2><ec2>: Abbrev Number: 0
 <1><ec3>: Abbrev Number: 15 (DW_TAG_structure_type)
    <ec4>   DW_AT_byte_size   : 144
    <ec5>   DW_AT_decl_file   : 2
    <ec6>   DW_AT_decl_line   : 335
    <ec8>   DW_AT_decl_column : 9
    <ec9>   DW_AT_sibling     : <0x104d>
 <2><ecd>: Abbrev Number: 7 (DW_TAG_member)
    <ece>   DW_AT_name        : CR
    <ed1>   DW_AT_decl_file   : 2
    <ed1>   DW_AT_decl_line   : 337
    <ed3>   DW_AT_decl_column : 17
    <ed3>   DW_AT_type        : <0xe9e>
    <ed7>   DW_AT_data_member_location: 0
 <2><ed8>: Abbrev Number: 2 (DW_TAG_member)
    <ed9>   DW_AT_name        : (indirect string, offset: 0x6f261): PLLCFGR
    <edd>   DW_AT_decl_file   : 2
    <edd>   DW_AT_decl_line   : 338
    <edf>   DW_AT_decl_column : 17
    <edf>   DW_AT_type        : <0xe9e>
    <ee3>   DW_AT_data_member_location: 4
 <2><ee4>: Abbrev Number: 2 (DW_TAG_member)
    <ee5>   DW_AT_name        : (indirect string, offset: 0x44435): CFGR
    <ee9>   DW_AT_decl_file   : 2
    <ee9>   DW_AT_decl_line   : 339
    <eeb>   DW_AT_decl_column : 17
    <eeb>   DW_AT_type        : <0xe9e>
    <eef>   DW_AT_data_member_location: 8
 <2><ef0>: Abbrev Number: 7 (DW_TAG_member)
    <ef1>   DW_AT_name        : CIR
    <ef5>   DW_AT_decl_file   : 2
    <ef5>   DW_AT_decl_line   : 340
    <ef7>   DW_AT_decl_column : 17
    <ef7>   DW_AT_type        : <0xe9e>
    <efb>   DW_AT_data_member_location: 12
 <2><efc>: Abbrev Number: 2 (DW_TAG_member)
    <efd>   DW_AT_name        : (indirect string, offset: 0x7f16b): AHB1RSTR
    <f01>   DW_AT_decl_file   : 2
    <f01>   DW_AT_decl_line   : 341
    <f03>   DW_AT_decl_column : 17
    <f03>   DW_AT_type        : <0xe9e>
    <f07>   DW_AT_data_member_location: 16
 <2><f08>: Abbrev Number: 2 (DW_TAG_member)
    <f09>   DW_AT_name        : (indirect string, offset: 0x11d91): AHB2RSTR
    <f0d>   DW_AT_decl_file   : 2
    <f0d>   DW_AT_decl_line   : 342
    <f0f>   DW_AT_decl_column : 17
    <f0f>   DW_AT_type        : <0xe9e>
    <f13>   DW_AT_data_member_location: 20
 <2><f14>: Abbrev Number: 2 (DW_TAG_member)
    <f15>   DW_AT_name        : (indirect string, offset: 0x442b2): AHB3RSTR
    <f19>   DW_AT_decl_file   : 2
    <f19>   DW_AT_decl_line   : 343
    <f1b>   DW_AT_decl_column : 17
    <f1b>   DW_AT_type        : <0xe9e>
    <f1f>   DW_AT_data_member_location: 24
 <2><f20>: Abbrev Number: 2 (DW_TAG_member)
    <f21>   DW_AT_name        : (indirect string, offset: 0x9608d): RESERVED0
    <f25>   DW_AT_decl_file   : 2
    <f25>   DW_AT_decl_line   : 344
    <f27>   DW_AT_decl_column : 17
    <f27>   DW_AT_type        : <0xe92>
    <f2b>   DW_AT_data_member_location: 28
 <2><f2c>: Abbrev Number: 2 (DW_TAG_member)
    <f2d>   DW_AT_name        : (indirect string, offset: 0x1196e): APB1RSTR
    <f31>   DW_AT_decl_file   : 2
    <f31>   DW_AT_decl_line   : 345
    <f33>   DW_AT_decl_column : 17
    <f33>   DW_AT_type        : <0xe9e>
    <f37>   DW_AT_data_member_location: 32
 <2><f38>: Abbrev Number: 2 (DW_TAG_member)
    <f39>   DW_AT_name        : (indirect string, offset: 0x43dab): APB2RSTR
    <f3d>   DW_AT_decl_file   : 2
    <f3d>   DW_AT_decl_line   : 346
    <f3f>   DW_AT_decl_column : 17
    <f3f>   DW_AT_type        : <0xe9e>
    <f43>   DW_AT_data_member_location: 36
 <2><f44>: Abbrev Number: 2 (DW_TAG_member)
    <f45>   DW_AT_name        : (indirect string, offset: 0x96097): RESERVED1
    <f49>   DW_AT_decl_file   : 2
    <f49>   DW_AT_decl_line   : 347
    <f4b>   DW_AT_decl_column : 17
    <f4b>   DW_AT_type        : <0xeb3>
    <f4f>   DW_AT_data_member_location: 40
 <2><f50>: Abbrev Number: 2 (DW_TAG_member)
    <f51>   DW_AT_name        : (indirect string, offset: 0xca35): AHB1ENR
    <f55>   DW_AT_decl_file   : 2
    <f55>   DW_AT_decl_line   : 348
    <f57>   DW_AT_decl_column : 17
    <f57>   DW_AT_type        : <0xe9e>
    <f5b>   DW_AT_data_member_location: 48
 <2><f5c>: Abbrev Number: 2 (DW_TAG_member)
    <f5d>   DW_AT_name        : (indirect string, offset: 0x29915): AHB2ENR
    <f61>   DW_AT_decl_file   : 2
    <f61>   DW_AT_decl_line   : 349
    <f63>   DW_AT_decl_column : 17
    <f63>   DW_AT_type        : <0xe9e>
    <f67>   DW_AT_data_member_location: 52
 <2><f68>: Abbrev Number: 2 (DW_TAG_member)
    <f69>   DW_AT_name        : (indirect string, offset: 0x46606): AHB3ENR
    <f6d>   DW_AT_decl_file   : 2
    <f6d>   DW_AT_decl_line   : 350
    <f6f>   DW_AT_decl_column : 17
    <f6f>   DW_AT_type        : <0xe9e>
    <f73>   DW_AT_data_member_location: 56
 <2><f74>: Abbrev Number: 2 (DW_TAG_member)
    <f75>   DW_AT_name        : (indirect string, offset: 0x960a1): RESERVED2
    <f79>   DW_AT_decl_file   : 2
    <f79>   DW_AT_decl_line   : 351
    <f7b>   DW_AT_decl_column : 17
    <f7b>   DW_AT_type        : <0xe92>
    <f7f>   DW_AT_data_member_location: 60
 <2><f80>: Abbrev Number: 2 (DW_TAG_member)
    <f81>   DW_AT_name        : (indirect string, offset: 0x7804c): APB1ENR
    <f85>   DW_AT_decl_file   : 2
    <f85>   DW_AT_decl_line   : 352
    <f87>   DW_AT_decl_column : 17
    <f87>   DW_AT_type        : <0xe9e>
    <f8b>   DW_AT_data_member_location: 64
 <2><f8c>: Abbrev Number: 2 (DW_TAG_member)
    <f8d>   DW_AT_name        : (indirect string, offset: 0x125a0): APB2ENR
    <f91>   DW_AT_decl_file   : 2
    <f91>   DW_AT_decl_line   : 353
    <f93>   DW_AT_decl_column : 17
    <f93>   DW_AT_type        : <0xe9e>
    <f97>   DW_AT_data_member_location: 68
 <2><f98>: Abbrev Number: 2 (DW_TAG_member)
    <f99>   DW_AT_name        : (indirect string, offset: 0x960ab): RESERVED3
    <f9d>   DW_AT_decl_file   : 2
    <f9d>   DW_AT_decl_line   : 354
    <f9f>   DW_AT_decl_column : 17
    <f9f>   DW_AT_type        : <0xeb3>
    <fa3>   DW_AT_data_member_location: 72
 <2><fa4>: Abbrev Number: 2 (DW_TAG_member)
    <fa5>   DW_AT_name        : (indirect string, offset: 0x4e7fa): AHB1LPENR
    <fa9>   DW_AT_decl_file   : 2
    <fa9>   DW_AT_decl_line   : 355
    <fab>   DW_AT_decl_column : 17
    <fab>   DW_AT_type        : <0xe9e>
    <faf>   DW_AT_data_member_location: 80
 <2><fb0>: Abbrev Number: 2 (DW_TAG_member)
    <fb1>   DW_AT_name        : (indirect string, offset: 0x22f84): AHB2LPENR
    <fb5>   DW_AT_decl_file   : 2
    <fb5>   DW_AT_decl_line   : 356
    <fb7>   DW_AT_decl_column : 17
    <fb7>   DW_AT_type        : <0xe9e>
    <fbb>   DW_AT_data_member_location: 84
 <2><fbc>: Abbrev Number: 2 (DW_TAG_member)
    <fbd>   DW_AT_name        : (indirect string, offset: 0x6b2f5): AHB3LPENR
    <fc1>   DW_AT_decl_file   : 2
    <fc1>   DW_AT_decl_line   : 357
    <fc3>   DW_AT_decl_column : 17
    <fc3>   DW_AT_type        : <0xe9e>
    <fc7>   DW_AT_data_member_location: 88
 <2><fc8>: Abbrev Number: 2 (DW_TAG_member)
    <fc9>   DW_AT_name        : (indirect string, offset: 0x960b5): RESERVED4
    <fcd>   DW_AT_decl_file   : 2
    <fcd>   DW_AT_decl_line   : 358
    <fcf>   DW_AT_decl_column : 17
    <fcf>   DW_AT_type        : <0xe92>
    <fd3>   DW_AT_data_member_location: 92
 <2><fd4>: Abbrev Number: 2 (DW_TAG_member)
    <fd5>   DW_AT_name        : (indirect string, offset: 0x6996a): APB1LPENR
    <fd9>   DW_AT_decl_file   : 2
    <fd9>   DW_AT_decl_line   : 359
    <fdb>   DW_AT_decl_column : 17
    <fdb>   DW_AT_type        : <0xe9e>
    <fdf>   DW_AT_data_member_location: 96
 <2><fe0>: Abbrev Number: 2 (DW_TAG_member)
    <fe1>   DW_AT_name        : (indirect string, offset: 0xbc3c): APB2LPENR
    <fe5>   DW_AT_decl_file   : 2
    <fe5>   DW_AT_decl_line   : 360
    <fe7>   DW_AT_decl_column : 17
    <fe7>   DW_AT_type        : <0xe9e>
    <feb>   DW_AT_data_member_location: 100
 <2><fec>: Abbrev Number: 2 (DW_TAG_member)
    <fed>   DW_AT_name        : (indirect string, offset: 0x960bf): RESERVED5
    <ff1>   DW_AT_decl_file   : 2
    <ff1>   DW_AT_decl_line   : 361
    <ff3>   DW_AT_decl_column : 17
    <ff3>   DW_AT_type        : <0xeb3>
    <ff7>   DW_AT_data_member_location: 104
 <2><ff8>: Abbrev Number: 2 (DW_TAG_member)
    <ff9>   DW_AT_name        : (indirect string, offset: 0x15d36): BDCR
    <ffd>   DW_AT_decl_file   : 2
    <ffd>   DW_AT_decl_line   : 362
    <fff>   DW_AT_decl_column : 17
    <fff>   DW_AT_type        : <0xe9e>
    <1003>   DW_AT_data_member_location: 112
 <2><1004>: Abbrev Number: 7 (DW_TAG_member)
    <1005>   DW_AT_name        : CSR
    <1009>   DW_AT_decl_file   : 2
    <1009>   DW_AT_decl_line   : 363
    <100b>   DW_AT_decl_column : 17
    <100b>   DW_AT_type        : <0xe9e>
    <100f>   DW_AT_data_member_location: 116
 <2><1010>: Abbrev Number: 2 (DW_TAG_member)
    <1011>   DW_AT_name        : (indirect string, offset: 0x960c9): RESERVED6
    <1015>   DW_AT_decl_file   : 2
    <1015>   DW_AT_decl_line   : 364
    <1017>   DW_AT_decl_column : 17
    <1017>   DW_AT_type        : <0xeb3>
    <101b>   DW_AT_data_member_location: 120
 <2><101c>: Abbrev Number: 2 (DW_TAG_member)
    <101d>   DW_AT_name        : (indirect string, offset: 0x53cec): SSCGR
    <1021>   DW_AT_decl_file   : 2
    <1021>   DW_AT_decl_line   : 365
    <1023>   DW_AT_decl_column : 17
    <1023>   DW_AT_type        : <0xe9e>
    <1027>   DW_AT_data_member_location: 128
 <2><1028>: Abbrev Number: 2 (DW_TAG_member)
    <1029>   DW_AT_name        : (indirect string, offset: 0x33fb7): PLLI2SCFGR
    <102d>   DW_AT_decl_file   : 2
    <102d>   DW_AT_decl_line   : 366
    <102f>   DW_AT_decl_column : 17
    <102f>   DW_AT_type        : <0xe9e>
    <1033>   DW_AT_data_member_location: 132
 <2><1034>: Abbrev Number: 2 (DW_TAG_member)
    <1035>   DW_AT_name        : (indirect string, offset: 0x960d3): RESERVED7
    <1039>   DW_AT_decl_file   : 2
    <1039>   DW_AT_decl_line   : 367
    <103b>   DW_AT_decl_column : 17
    <103b>   DW_AT_type        : <0xea3>
    <103f>   DW_AT_data_member_location: 136
 <2><1040>: Abbrev Number: 2 (DW_TAG_member)
    <1041>   DW_AT_name        : (indirect string, offset: 0x44432): DCKCFGR
    <1045>   DW_AT_decl_file   : 2
    <1045>   DW_AT_decl_line   : 368
    <1047>   DW_AT_decl_column : 17
    <1047>   DW_AT_type        : <0xe9e>
    <104b>   DW_AT_data_member_location: 140
 <2><104c>: Abbrev Number: 0
 <1><104d>: Abbrev Number: 16 (DW_TAG_typedef)
    <104e>   DW_AT_name        : (indirect string, offset: 0x49034): RCC_TypeDef
    <1052>   DW_AT_decl_file   : 2
    <1053>   DW_AT_decl_line   : 369
    <1055>   DW_AT_decl_column : 3
    <1056>   DW_AT_type        : <0xec3>
 <1><105a>: Abbrev Number: 3 (DW_TAG_base_type)
    <105b>   DW_AT_byte_size   : 8
    <105c>   DW_AT_encoding    : 4	(float)
    <105d>   DW_AT_name        : (indirect string, offset: 0xa336e): long double
 <1><1061>: Abbrev Number: 10 (DW_TAG_subprogram)
    <1062>   DW_AT_external    : 1
    <1062>   DW_AT_name        : (indirect string, offset: 0x13066): HAL_NVIC_EnableIRQ
    <1066>   DW_AT_decl_file   : 5
    <1066>   DW_AT_decl_line   : 262
    <1068>   DW_AT_decl_column : 6
    <1068>   DW_AT_prototyped  : 1
    <1068>   DW_AT_declaration : 1
    <1068>   DW_AT_sibling     : <0x1072>
 <2><106c>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <106d>   DW_AT_type        : <0xe3b>
 <2><1071>: Abbrev Number: 0
 <1><1072>: Abbrev Number: 10 (DW_TAG_subprogram)
    <1073>   DW_AT_external    : 1
    <1073>   DW_AT_name        : (indirect string, offset: 0x840dc): HAL_NVIC_SetPriority
    <1077>   DW_AT_decl_file   : 5
    <1077>   DW_AT_decl_line   : 261
    <1079>   DW_AT_decl_column : 6
    <1079>   DW_AT_prototyped  : 1
    <1079>   DW_AT_declaration : 1
    <1079>   DW_AT_sibling     : <0x108d>
 <2><107d>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <107e>   DW_AT_type        : <0xe3b>
 <2><1082>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <1083>   DW_AT_type        : <0xe92>
 <2><1087>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <1088>   DW_AT_type        : <0xe92>
 <2><108c>: Abbrev Number: 0
 <1><108d>: Abbrev Number: 17 (DW_TAG_subprogram)
    <108e>   DW_AT_external    : 1
    <108e>   DW_AT_name        : (indirect string, offset: 0x9fa98): MX_DMA_Init
    <1092>   DW_AT_decl_file   : 1
    <1093>   DW_AT_decl_line   : 39
    <1094>   DW_AT_decl_column : 6
    <1095>   DW_AT_prototyped  : 1
    <1095>   DW_AT_low_pc      : 0x80012c4
    <1099>   DW_AT_high_pc     : 0x60
    <109d>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <109f>   DW_AT_call_all_tail_calls: 1
 <2><109f>: Abbrev Number: 18 (DW_TAG_lexical_block)
    <10a0>   DW_AT_low_pc      : 0x80012ca
    <10a4>   DW_AT_high_pc     : 0x1c
 <3><10a8>: Abbrev Number: 19 (DW_TAG_variable)
    <10a9>   DW_AT_name        : (indirect string, offset: 0xa9281): tmpreg
    <10ad>   DW_AT_decl_file   : 1
    <10ae>   DW_AT_decl_line   : 43
    <10af>   DW_AT_decl_column : 3
    <10b0>   DW_AT_type        : <0xe9e>
    <10b4>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <3><10b7>: Abbrev Number: 0
 <2><10b8>: Abbrev Number: 0
 <1><10b9>: Abbrev Number: 0
  Compilation Unit @ offset 0x10ba:
   Length:        0x463 (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0x362
   Pointer Size:  4
 <0><10c6>: Abbrev Number: 17 (DW_TAG_compile_unit)
    <10c7>   DW_AT_producer    : (indirect string, offset: 0x3a6a4): GNU C11 12.3.1 20230626 -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <10cb>   DW_AT_language    : 29	(C11)
    <10cc>   DW_AT_name        : (indirect string, offset: 0x9fac3): ../Core/Src/gpio.c
    <10d0>   DW_AT_comp_dir    : (indirect string, offset: 0x2c8d4): /Users/alybadawy/repos/Vexuf-Project/Firmwares/Horus/Debug
    <10d4>   DW_AT_ranges      : 0x47
    <10d8>   DW_AT_low_pc      : 0
    <10dc>   DW_AT_stmt_list   : 0x10be
    <10e0>   DW_AT_macros      : 0x577
 <1><10e4>: Abbrev Number: 2 (DW_TAG_base_type)
    <10e5>   DW_AT_byte_size   : 1
    <10e6>   DW_AT_encoding    : 6	(signed char)
    <10e7>   DW_AT_name        : (indirect string, offset: 0x4f5ea): signed char
 <1><10eb>: Abbrev Number: 3 (DW_TAG_typedef)
    <10ec>   DW_AT_name        : (indirect string, offset: 0x9fae5): __uint8_t
    <10f0>   DW_AT_decl_file   : 2
    <10f1>   DW_AT_decl_line   : 43
    <10f2>   DW_AT_decl_column : 24
    <10f3>   DW_AT_type        : <0x10f7>
 <1><10f7>: Abbrev Number: 2 (DW_TAG_base_type)
    <10f8>   DW_AT_byte_size   : 1
    <10f9>   DW_AT_encoding    : 8	(unsigned char)
    <10fa>   DW_AT_name        : (indirect string, offset: 0x1fd87): unsigned char
 <1><10fe>: Abbrev Number: 2 (DW_TAG_base_type)
    <10ff>   DW_AT_byte_size   : 2
    <1100>   DW_AT_encoding    : 5	(signed)
